{
    "nodes": [
        {
            "id": "1",
            "name": "RF Communications Fundamentals",
            "description": "Foundational concepts in RF communication systems."
        },
        {
            "id": "1.1",
            "name": "Signal Types",
            "description": "Classification of analog and digital modulation schemes."
        },
        {
            "id": "1.2",
            "name": "Frequency Spectrum",
            "description": "Organization and use of frequency bands."
        },
        {
            "id": "1.3",
            "name": "Modulation and Demodulation Concepts",
            "description": "Signal synchronization and recovery principles."
        },
        {
            "id": "1.4",
            "name": "RF Front-End Architecture",
            "description": "Signal chain from antenna to ADC/DAC."
        },
        {
            "id": "1.5",
            "name": "Propagation and Channel Fundamentals",
            "description": "Mechanisms of RF signal transmission and fading."
        },
        {
            "id": "1.6",
            "name": "Antenna Fundamentals",
            "description": "Antennas are reciprocal transducers that serve as the critical interface between a transmission line and free-space, efficiently radiating or capturing electromagnetic energy. They operate based on Maxwell's equations, accelerating electrical charges to produce propagating electromagnetic waves, characterized by specific radiation patterns, gain (measured in dBi or dBd), efficiency, and impedance matching. The fundamental operation depends on the physical dimensions, particularly in relation to the wavelength of the operating frequency, dictating characteristics like resonance and polarization (linear, circular, or elliptical) crucial for reliable wireless communication links."
        },
        {
            "id": "2",
            "name": "RF System Design Parameters",
            "description": "RF system design is fundamentally governed by parameters such as Link Budget analysis, which calculates the total gain and loss from transmitter to receiver to ensure adequate Signal-to-Noise Ratio (SNR) or Bit Error Rate (BER) for reliable communication. Key electrical specifications include transmit power (EIRP/ERP), receiver sensitivity (minimum detectable signal), noise figure (NF), and dynamic range, all of which directly impact the achievable communication distance and data rate. Other critical factors involve frequency allocation, channel bandwidth, antenna gain and pattern, and regulatory compliance (e.g., FCC, ETSI limits) concerning spurious emissions and maximum power output, defining the practical and legal boundaries of the system's performance."
        },
        {
            "id": "2.1",
            "name": "System-level design",
            "description": "System-level design is the foundational phase of engineering where the entire functional architecture of a complex electronic or RF product is defined and partitioned into major subsystems. This process involves establishing top-level performance requirements, allocating critical budgets—such as power consumption, noise figure, link margin, and dynamic range—across the defined blocks (e.g., transceivers, processors, power management units). Key activities include defining standardized internal interfaces, managing system complexity, and executing crucial trade-off analyses (e.g., latency vs. throughput, cost vs. component linearity) to ensure that the integrated solution meets overall mission specifications and provides a verified, feasible blueprint for subsequent detailed component-level implementation."
        },
        {
            "id": "2.1",
            "name": "Link Budget Analysis",
            "description": "Power balance across the communication path."
        },
        {
            "id": "2.2",
            "name": "analysis",
            "description": "The systematic process of examining complex electrical systems, circuits, and electromagnetic wave propagation using mathematical models and fundamental engineering laws, including Kirchhoff's laws, Maxwell's equations, and network theory. In RF and high-speed electrical engineering, techniques such as S-parameter derivation, Fourier transformation, steady-state and transient response modeling, and impedance matching calculations are crucial for predicting system performance metrics like gain, bandwidth, noise figure, and stability. This predictive characterization is essential for validating system architecture, optimizing component selection, and ensuring compliance with established performance specifications across the frequency spectrum."
        },
        {
            "id": "2.2",
            "name": "Dynamic Range and Linearity",
            "description": "System linearity and compression performance."
        },
        {
            "id": "2.3",
            "name": "and performance optimization",
            "description": "Noise performance in RF systems quantifies the system's ability to receive and process weak signals relative to the inherent electrical noise. Key metrics include Noise Figure (NF), which measures the degradation of the signal-to-noise ratio (SNR) caused by components, and system sensitivity, which dictates the minimum detectable signal power. Optimizing noise performance, particularly in the receiver front-end, is crucial for maximizing range, data rates, and overall link quality."
        },
        {
            "id": "2.3",
            "name": "Noise Performance",
            "description": "Noise performance in RF systems quantifies the system's ability to receive and process weak signals relative to the inherent electrical noise. Key metrics include Noise Figure (NF), which measures the degradation of the signal-to-noise ratio (SNR) caused by components, and system sensitivity, which dictates the minimum detectable signal power. Optimizing noise performance, particularly in the receiver front-end, is crucial for maximizing range, data rates, and overall link quality."
        },
        {
            "id": "2.4",
            "name": "Linearity and Interference Robustness",
            "description": "Intermodulation and blocking behavior."
        },
        {
            "id": "2.5",
            "name": "Power Efficiency and Thermal Design",
            "description": "Efficiency optimization and thermal management."
        },
        {
            "id": "2.6",
            "name": "Impedance Matching and Stability",
            "description": "Stability and impedance transformations."
        },
        {
            "id": "3",
            "name": "Performance Metrics and Measurements",
            "description": "System performance quantification and testing."
        },
        {
            "id": "3.1",
            "name": "Spectral Performance",
            "description": "Bandwidth and emissions characterization."
        },
        {
            "id": "3.2",
            "name": "Receiver Performance",
            "description": "Receiver performance in RF systems quantifies a receiver's ability to successfully extract desired information from incoming RF signals, particularly in the presence of noise and interference. Key metrics include Sensitivity, which defines the minimum detectable signal power often limited by the receiver's intrinsic Noise Figure (NF); Selectivity, measured by adjacent channel rejection, which describes the ability to filter out signals close in frequency; and Linearity, assessed using the Third-Order Intercept Point (IP3) or Spurious-Free Dynamic Range (SFDR), which determines the receiver's resilience to strong interfering signals causing intermodulation distortion. High performance requires minimizing NF and maximizing both selectivity and dynamic range to ensure reliable signal reception across various operating conditions."
        },
        {
            "id": "3.3",
            "name": "Bit-Level Metrics",
            "description": "Bit error and vector error measurements."
        },
        {
            "id": "3.4",
            "name": "System-Level Metrics",
            "description": "End-to-end system KPIs."
        },
        {
            "id": "3.5",
            "name": "Nonlinear Distortion Metrics",
            "description": "These quantitative measurements assess the spurious spectral components generated when an RF device, such as an amplifier, operates outside its linear region, causing spectral regrowth. The most common metrics include Harmonic Distortion (HD) and Total Harmonic Distortion (THD), which quantify integer multiples of the fundamental frequency. Crucially, Intermodulation Distortion (IMD) characterizes the mixing of multiple input signals, typically measured using the Second and Third Order Intercept Points (IP2 and IP3) to predict a system's dynamic range. Further system-level evaluation uses the 1 dB Compression Point (P1dB) to define the maximum linear output power capability, and Adjacent Channel Power Ratio (ACPR) to measure spectral power leakage into neighboring communication bands."
        },
        {
            "id": "3.6",
            "name": "Time-Variant Metrics",
            "description": "Time-variant metrics are measurements or statistical characteristics quantifying systems or channels whose underlying properties are not constant over the observation interval, indicating a non-stationary or statistically non-ergodic process. In RF engineering, these typically describe the dynamic behavior of wireless links subject to movement and environmental changes, where the channel transfer function $H(t)$ is explicitly dependent on time. Key examples include the instantaneous Channel Impulse Response (CIR), Signal-to-Noise Ratio (SNR) in a mobile environment, and fading envelope statistics. Accurate characterization requires time-domain analysis, predictive modeling, and adaptive signal processing techniques to track rapid fluctuations, often leveraging statistics like the autocorrelation function to determine the maximum rate of change, such as the Doppler spread."
        },
        {
            "id": "4",
            "name": "RF Testing and Validation",
            "description": "Verification and measurement environments."
        },
        {
            "id": "4.1",
            "name": "Test Equipment",
            "description": "These specialized instruments are critical tools for the characterization, verification, and troubleshooting of electrical circuits and RF systems, operating across both the time and frequency domains. Key equipment includes signal generators, which produce controlled test stimuli; oscilloscopes, which analyze signals in the time domain for timing and amplitude measurements; spectrum analyzers, which evaluate frequency content, noise, and modulation quality; and vector network analyzers (VNAs), which characterize component impedance, phase response, and scattering parameters (S-parameters). Other essential devices, such as power meters and frequency counters, ensure precise measurement of fundamental physical and electrical parameters, guaranteeing that circuits and systems meet rigorous design specifications and operational standards."
        },
        {
            "id": "4.2",
            "name": "Test Environments",
            "description": "Test environments in RF communications are controlled settings designed to accurately characterize system performance, component behavior, and compliance with regulatory standards. Key environments include anechoic chambers, which simulate free-space conditions by absorbing reflections to measure antenna patterns and EIRP; reverberation chambers, which create a statistically uniform, multi-path field for immunity and shielding effectiveness testing; and open area test sites (OATS), which provide a large, low-reflection outdoor space primarily used for radiated emissions compliance testing. These environments manage electromagnetic interference and environmental factors like temperature and humidity to ensure reproducible and validated measurement results crucial for system design and certification."
        },
        {
            "id": "4.3",
            "name": "Automation and Control",
            "description": "Automation and Control in RF testing involve using software defined instruments, scripting languages (like Python or MATLAB), and standardized interfaces (like GPIB or LAN) to execute complex measurement sequences without manual intervention. This dramatically increases test throughput, ensures repeatability, reduces human error, and facilitates remote operation and continuous monitoring of critical RF infrastructure or production lines."
        },
        {
            "id": "4.4",
            "name": "Calibration and Verification",
            "description": "Instrument calibration and traceability."
        },
        {
            "id": "4.5",
            "name": "OTA MIMO/mmWave Testing",
            "description": "Over-The-Air (OTA) testing is mandatory for characterizing Multiple-Input Multiple-Output (MIMO) and millimeter-wave (mmWave) devices because traditional conductive testing fails to capture the spatial interactions and antenna array performance crucial at these frequencies. OTA testing utilizes shielded anechoic or reverberation chambers, along with sophisticated positioning systems, to accurately measure complex spatial parameters like effective isotropic radiated power (EIRP) and beam steering capabilities."
        },
        {
            "id": "4.6",
            "name": "EMC/EMI Testing",
            "description": "Regulatory emissions and susceptibility testing."
        },
        {
            "id": "5",
            "name": "Communication System Evaluation",
            "description": "System-level testing and field validation."
        },
        {
            "id": "5.1",
            "name": "Link-Level Simulation",
            "description": "Baseband modeling and BER validation."
        },
        {
            "id": "5.2",
            "name": "System-Level Testing",
            "description": "KPI and multi-user testing."
        },
        {
            "id": "5.3",
            "name": "Standards Compliance",
            "description": "Standards compliance ensures that RF devices and systems adhere to internationally recognized technical specifications (e.g., 3GPP, IEEE 802.11) and regulatory requirements (e.g., FCC, CE). This adherence is essential for achieving interoperability across different manufacturers, accessing licensed spectrum, and ensuring that transmitted power levels, spurious emissions, and signal structure meet the necessary operational and safety mandates."
        },
        {
            "id": "5.4",
            "name": "Field Measurements",
            "description": "Field measurements involve taking RF readings and performance data in the actual operational environment to characterize channel propagation effects, verify coverage maps, locate sources of interference, and validate network planning models. These measurements often employ spectrum analyzers, drive-test tools, and specialized receivers to accurately assess parameters such as signal strength, quality of service (QoS), and handover performance under real-world conditions."
        },
        {
            "id": "5.5",
            "name": "Reliability and Maintenance",
            "description": "Reliability and maintenance in RF systems focus on ensuring long-term operational integrity and minimizing downtime through robust hardware design, redundancy, and proactive monitoring. This includes calibrating test equipment periodically, implementing predictive maintenance strategies using built-in diagnostic tools, and designing systems that can withstand environmental stressors while maintaining specified performance metrics over their intended lifespan."
        },
        {
            "id": "5.6",
            "name": "Network-Level Coexistence",
            "description": "Inter-system interference and coexistence."
        },
        {
            "id": "6",
            "name": "Advanced Topics",
            "description": "Emerging and research-level areas in RF."
        },
        {
            "id": "6.1",
            "name": "MIMO and Beamforming",
            "description": "Simulation and modeling are critical RF engineering tools utilized to predict system behavior, optimize component placement, and analyze propagation effects before physical prototyping. This involves creating mathematical representations of RF channels, circuits, antennas, and complex system interactions using specialized software (like Keysight ADS or MATLAB) to accelerate design cycles and accurately characterize performance boundaries."
        },
        {
            "id": "6.1",
            "name": "Simulation & Modeling",
            "description": "Simulation and modeling are critical RF engineering tools utilized to predict system behavior, optimize component placement, and analyze propagation effects before physical prototyping. This involves creating mathematical representations of RF channels, circuits, antennas, and complex system interactions using specialized software (like Keysight ADS or MATLAB) to accelerate design cycles and accurately characterize performance boundaries."
        },
        {
            "id": "6.11",
            "name": "Non-Terrestrial Networks (NTN)",
            "description": "Non-Terrestrial Networks (NTN) integrate communication systems operating from space (satellites) or high altitude platforms (HAPS) with traditional terrestrial infrastructure to provide ubiquitous global connectivity, particularly in remote or underserved areas. Key challenges involve managing extremely long link distances, significant Doppler shifts, atmospheric attenuation, and ensuring seamless handoffs between terrestrial and non-terrestrial components."
        },
        {
            "id": "6.12",
            "name": "Terahertz & Sub-THz",
            "description": "Terahertz (THz) and Sub-THz frequencies (0.1 THz to 10 THz) offer immense unlicensed bandwidth for next-generation applications requiring extremely high data rates, such as 6G communication and high-resolution imaging. While providing exceptional capacity, these frequencies suffer from severe path loss, molecular absorption (especially by water vapor), and necessitate highly directive antennas, limiting applications primarily to short-range, line-of-sight communication."
        },
        {
            "id": "6.13",
            "name": "Quantum & Secure RF",
            "description": "Quantum and Secure RF explores novel methods for protecting wireless communications, including utilizing quantum entanglement principles to establish fundamentally secure cryptographic keys (Quantum Key Distribution or QKD) and developing physical layer security techniques. These techniques leverage unique channel characteristics and noise properties to detect eavesdropping or secure data transmission in ways that are resistant to classical computational attacks."
        },
        {
            "id": "6.14",
            "name": "Reconfigurable Intelligent Surfaces",
            "description": "Reconfigurable Intelligent Surfaces (RIS), also known as Intelligent Reflecting Surfaces (IRS), are planar structures composed of numerous passive, low-cost electromagnetic elements that can individually adjust the phase shift of incident RF signals. By dynamically controlling the reflection or refraction of radio waves, RIS transforms the propagation environment into a smart, tunable medium to enhance coverage, mitigate interference, and improve energy efficiency."
        },
        {
            "id": "6.15",
            "name": "Hardware Nonidealities",
            "description": "Hardware nonidealities refer to the unavoidable imperfections in physical RF components, such as power amplifier linearity issues (e.g., compression, memory effects), phase noise in oscillators, in-phase/quadrature (I/Q) imbalance, and thermal drift. These nonidealities degrade signal quality, increase error vector magnitude (EVM), and require sophisticated digital pre-distortion (DPD) or calibration techniques to maintain system performance standards."
        },
        {
            "id": "6.2",
            "name": "Adaptive Modulation and Coding",
            "description": "Adaptive Modulation and Coding (AMC) is a link adaptation technique where the communication system dynamically changes the modulation scheme (e.g., QPSK, 16-QAM, 64-QAM) and error correction coding rate based on the instantaneous quality of the channel. When the Signal-to-Noise Ratio (SNR) is high, the system uses higher-order modulation for faster data rates; conversely, it switches to more robust schemes when channel conditions degrade, maximizing spectral efficiency and link reliability."
        },
        {
            "id": "6.3",
            "name": "Cognitive Radio",
            "description": "Spectrum sensing and access."
        },
        {
            "id": "6.4",
            "name": "Machine Learning for RF",
            "description": "Machine Learning (ML) is being applied extensively in RF systems for optimizing complex tasks that are difficult to model deterministically, such as cognitive radio functions like dynamic spectrum allocation, interference classification, and real-time beamforming optimization. ML algorithms, including deep neural networks, enable RF systems to learn from massive datasets of spectral and environmental conditions, leading to more efficient resource management and autonomous decision-making."
        },
        {
            "id": "6.5",
            "name": "Radar Systems",
            "description": "Radar (Radio Detection and Ranging) systems transmit electromagnetic energy and analyze the backscattered echoes to determine the range, velocity, and angle of targets. Modern radar technology includes Frequency Modulated Continuous Wave (FMCW) for high-resolution distance measurement, Pulse-Doppler radar for velocity tracking, and synthetic aperture radar (SAR) for high-resolution imaging, finding applications in automotive safety, surveillance, and weather monitoring."
        },
        {
            "id": "6.6",
            "name": "Electronic Warfare",
            "description": "Electronic Warfare (EW) involves the military use of the electromagnetic spectrum to control or deny an opponent's use of that spectrum while ensuring friendly use. EW is broadly categorized into Electronic Attack (EA), which includes jamming and deception; Electronic Protection (EP), which involves safeguarding friendly communications; and Electronic Support (ES), which focuses on spectrum surveillance and threat identification."
        },
        {
            "id": "6.7",
            "name": "Interference Management",
            "description": "Interference management encompasses the techniques used to identify, characterize, and mitigate unwanted electromagnetic energy that degrades the performance of desired communication signals. Strategies include frequency planning, spatial filtering via advanced antenna arrays, adaptive power control, and active interference cancellation techniques implemented at the receiver, all aimed at improving the Signal-to-Interference-plus-Noise Ratio (SINR) and ensuring system co-existence."
        },
        {
            "id": "6.8",
            "name": "RF Sensing & ISAC",
            "description": "Joint radar-comm waveform design."
        },
        {
            "id": "6.9",
            "name": "Hardware & Calibration",
            "description": "Hardware and calibration refer to the physical design, construction, and precise adjustment of RF components and test equipment necessary to meet stringent performance requirements. Calibration involves applying traceable standards to correct for frequency drift, gain variations, and amplitude inaccuracies inherent in analog components, ensuring that measurement results are accurate and repeatable across different instruments and environments."
        },
        {
            "id": "7",
            "name": "RF System Integration and Implementation",
            "description": "Practical realization and manufacturing."
        },
        {
            "id": "7.1",
            "name": "PCB Design",
            "description": "RF Printed Circuit Board (PCB) design is a specialized discipline focused on high-frequency layout techniques to minimize signal loss, cross-coupling, and radiation effects. This involves careful planning of transmission lines (e.g., microstrip, stripline) to maintain precise 50-ohm impedance matching, minimizing trace lengths, utilizing proper grounding and shielding via stitching, and selecting appropriate low-loss dielectric materials to preserve signal integrity."
        },
        {
            "id": "7.2",
            "name": "Packaging and Integration",
            "description": "Packaging and integration refers to the physical enclosure and interconnection of RF circuits, which is critical for maintaining performance characteristics at high frequencies, often dictating thermal management, impedance control, and parasitic suppression. Proper packaging, such as the use of System-in-Package (SiP) or highly controlled Module integration, minimizes transmission line losses and ensures necessary isolation between sensitive RF blocks, directly impacting the final efficiency, size, and cost of the communication system."
        },
        {
            "id": "7.3",
            "name": "Measurement Uncertainty",
            "description": "Measurement uncertainty is the quantification of doubt associated with a measurement result, crucial in RF testing due to inherent noise, equipment limitations, and environmental variations that affect high-frequency signals. It includes systematic errors (bias) and random errors, and quantifying this uncertainty ensures that test results are traceable, reliable, and compliant with regulatory standards, often calculated using statistical methods like the root-sum-square (RSS) of known error sources."
        },
        {
            "id": "1.1.1",
            "name": "Amplitude Modulation (AM)",
            "description": "Basic analog modulation varying carrier amplitude."
        },
        {
            "id": "1.1.10",
            "name": "Up/Down Conversion",
            "description": "Frequency translation and mixing operations."
        },
        {
            "id": "1.1.2",
            "name": "Frequency Modulation (FM)",
            "description": "Frequency deviation based analog modulation."
        },
        {
            "id": "1.1.3",
            "name": "Phase Modulation (PM)",
            "description": "Phase-based analog modulation scheme."
        },
        {
            "id": "1.1.4",
            "name": "SSB / DSB-SC / VSB",
            "description": "Sideband modulation techniques and efficiency."
        },
        {
            "id": "1.1.5",
            "name": "Bandwidth Efficiency and Demodulation",
            "description": "Trade-offs and demodulation principles."
        },
        {
            "id": "1.1.6",
            "name": "ASK / FSK / PSK / QAM",
            "description": "Core digital modulation types."
        },
        {
            "id": "1.1.7",
            "name": "OFDM / FBMC / UFMC",
            "description": "Multicarrier modulation schemes."
        },
        {
            "id": "1.1.8",
            "name": "Pulse Shaping Filters",
            "description": "Raised Cosine and SRRC filtering."
        },
        {
            "id": "1.1.9",
            "name": "IQ Representation and Complex Envelope",
            "description": "Baseband/passband modeling concepts."
        },
        {
            "id": "1.2.1",
            "name": "HF / VHF / UHF / SHF / EHF",
            "description": "Band definitions and characteristics."
        },
        {
            "id": "1.2.2",
            "name": "HF Applications",
            "description": "Long-range communications and propagation."
        },
        {
            "id": "1.2.3",
            "name": "VHF Applications",
            "description": "Broadcast and airband communications."
        },
        {
            "id": "1.2.4",
            "name": "UHF Applications",
            "description": "The Ultra High Frequency (UHF) band, spanning 300 MHz to 3 GHz, is extensively used for both mobile and fixed communication systems due to its favorable balance between penetration capabilities, which are better than higher microwave frequencies, and reasonably compact antenna sizes. Key applications include mobile cellular services, broadcast TV, Global Positioning System (GPS), and modern wireless local area network (WLAN) technologies."
        },
        {
            "id": "1.2.4.1",
            "name": "Cellular",
            "description": "Cellular systems rely heavily on the UHF band for wide-area mobile connectivity, leveraging licensed frequencies typically between 700 MHz and 2.7 GHz for 3G, 4G LTE, and mid-band 5G deployments. These frequencies provide the necessary balance of wide coverage range, low path loss relative to higher bands, and sufficient data capacity needed for dense urban and suburban mobile communication networks."
        },
        {
            "id": "1.2.4.2",
            "name": "Wi-Fi systems",
            "description": "Wi-Fi systems utilize specific UHF spectrum, prominently the 2.4 GHz Industrial, Scientific, and Medical (ISM) band for early and common IEEE 802.11 standards, alongside the higher 5 GHz and 6 GHz bands used for modern, high-throughput standards like 802.11ac and 802.11ax. The 2.4 GHz portion within UHF provides good signal penetration through walls suitable for general indoor networking."
        },
        {
            "id": "1.2.5",
            "name": "SHF/EHF Applications",
            "description": "Radar and satellite systems."
        },
        {
            "id": "1.2.6",
            "name": "Regulatory Bodies",
            "description": "Regulatory Bodies are national and international organizations responsible for managing the finite radio spectrum resource, allocating specific frequency bands to different services, setting technical standards for equipment emissions and immunity, and enforcing licensing requirements to prevent harmful interference between various communication services globally. Their coordination is essential for ensuring technological interoperability."
        },
        {
            "id": "1.2.6.1",
            "name": "ITU",
            "description": "The International Telecommunication Union (ITU) is a specialized agency of the United Nations that coordinates global shared use of the radio spectrum, sets international technical standards, and develops international treaty agreements defining frequency allocations across various services (e.g., mobile, fixed, satellite, amateur) through World Radiocommunication Conferences (WRCs)."
        },
        {
            "id": "1.2.6.2",
            "name": "ETSI",
            "description": "The European Telecommunications Standards Institute (ETSI) is an independent, non-profit organization that produces harmonized standards and technical specifications for Information and Communications Technology (ICT) across Europe and globally. ETSI defines key technical specifications for widely adopted systems like GSM, 3GPP, and DECT, playing a crucial role in European market access and technological development."
        },
        {
            "id": "1.2.6.3",
            "name": "FCC coordination",
            "description": "The Federal Communications Commission (FCC) is the primary regulatory body in the United States, managing spectrum allocation, enforcing licensing rules, and establishing technical standards for all radio and wireline communications equipment sold or used domestically. The FCC ensures efficient spectrum utilization and coordinates with international bodies like the ITU while retaining final authority over U.S. spectrum policy."
        },
        {
            "id": "1.2.7",
            "name": "Frequency Reuse and Planning",
            "description": "Reuse factors and guard bands."
        },
        {
            "id": "1.3.1",
            "name": "Carrier Synchronization",
            "description": "PLLs and Costas loops."
        },
        {
            "id": "1.3.2",
            "name": "Symbol Timing Recovery",
            "description": "Gardner and Mueller & Müller algorithms."
        },
        {
            "id": "1.3.3",
            "name": "Equalization",
            "description": "Equalization is a signal processing technique employed in receivers to mitigate channel impairments, primarily intersymbol interference (ISI) caused by multipath propagation and frequency-selective fading. This process applies a filter operation designed to approximate the inverse of the communication channel's impulse response, thereby restoring the distinct shape of the transmitted data symbols."
        },
        {
            "id": "1.3.3.1",
            "name": "Linear",
            "description": "Linear equalization uses a simple transversal filter structure, such as a Finite Impulse Response (FIR) filter, applied directly to the received signal, typically optimizing the filter taps to minimize the mean square error (MSE) between the filtered output and the original transmitted symbols, although its effectiveness is often limited in channels with deep spectral nulls where it may lead to significant noise boosting."
        },
        {
            "id": "1.3.3.2",
            "name": "DFE",
            "description": "Decision Feedback Equalization (DFE) improves upon linear methods by using a feedback loop where previously detected, or \"decided,\" symbols are fed back, weighted, and subtracted from the incoming signal to cancel the post-cursor intersymbol interference. This structure generally provides superior performance in severe ISI environments without the excessive noise amplification characteristic of purely linear equalizers."
        },
        {
            "id": "1.3.3.3",
            "name": "and adaptive methods",
            "description": "Adaptive equalization methods allow the equalizer coefficients (taps) to continuously adjust over time based on real-time channel estimation and tracking algorithms, such as Least Mean Squares (LMS) or Recursive Least Squares (RLS). This adaptation is essential in mobile communication environments where channel characteristics, determined by motion and fading, vary rapidly, ensuring the receiver maintains optimal performance."
        },
        {
            "id": "1.3.4",
            "name": "Error Detection",
            "description": "Error detection involves adding systematic redundancy to transmitted data to allow the receiver to determine if corruption occurred during transmission over a noisy channel. This is achieved by generating and appending a fixed-length check value derived mathematically from the data block, signaling the receiver to request retransmission if the check value verification fails."
        },
        {
            "id": "1.3.4.1",
            "name": "CRC",
            "description": "Cyclic Redundancy Check (CRC) is a robust polynomial code commonly used for error detection, where the data block is treated as a binary polynomial and divided by a predetermined generator polynomial; the remainder forms the CRC checksum. CRC offers excellent detection capabilities for nearly all single and double-bit errors, and for burst errors up to the degree of the generator polynomial."
        },
        {
            "id": "1.3.4.2",
            "name": "parity",
            "description": "Parity checking is the simplest error detection method, adding a single binary bit (the parity bit) to a block of data such that the total number of '1' bits in the resulting word is either always even or always odd. This method can only detect an odd number of bit errors within the block, making it ineffective against even numbers of errors or long bursts."
        },
        {
            "id": "1.3.4.3",
            "name": "checksum",
            "description": "A checksum is a fixed-size value computed by summing the numerical values of data units in a block, often using one's complement arithmetic, which is primarily used to detect accidental corruption of data in memory or during file transfer. While simple and computationally light, it is less robust than CRC against certain systematic or burst errors in communication links."
        },
        {
            "id": "1.3.5",
            "name": "Spectral Efficiency",
            "description": "Trade-offs between bits/Hz and robustness."
        },
        {
            "id": "1.4.1",
            "name": "Transmitter Chain",
            "description": "DAC → Mixer → PA → Filter → Antenna."
        },
        {
            "id": "1.4.2",
            "name": "Receiver Chain",
            "description": "Antenna → LNA → Mixer → Filter → ADC."
        },
        {
            "id": "1.4.3",
            "name": "LNA",
            "description": "Noise figure optimization and impedance matching."
        },
        {
            "id": "1.4.4",
            "name": "Mixer",
            "description": "LO leakage and image rejection."
        },
        {
            "id": "1.4.5",
            "name": "Filters",
            "description": "Filters are essential RF components designed to selectively pass signals within a specified frequency range while significantly attenuating signals outside that range, crucial for mitigating interference, shaping the transmitted spectrum to comply with regulatory masks, and isolating desired frequencies in both the transmitter upconversion and receiver downconversion chains."
        },
        {
            "id": "1.4.5.1",
            "name": "BPF",
            "description": "A Band Pass Filter (BPF) allows signals within a designated range of frequencies to pass through essentially unimpeded while rapidly rejecting frequencies both above and below the passband. BPFs are typically employed in intermediate frequency (IF) stages and RF front-ends for channel selection, isolating the intended signal from adjacent channels."
        },
        {
            "id": "1.4.5.2",
            "name": "LPF",
            "description": "A Low Pass Filter (LPF) allows frequencies from DC up to a specified cutoff frequency to pass while attenuating higher frequencies. LPFs are critical in RF systems for smoothing modulation waveforms, removing unwanted harmonics generated by power amplifiers, and suppressing spurious high-frequency content before transmission or after the final stage of demodulation."
        },
        {
            "id": "1.4.5.3",
            "name": "SAW/BAW design",
            "description": "SAW/BAW resonators are critical filter technologies leveraging piezoelectric effects for RF selectivity, where Surface Acoustic Wave (SAW) devices operate on the substrate surface, typically below 2.5 GHz, while Bulk Acoustic Wave (BAW) technology, often utilizing Film Bulk Acoustic Resonators (FBAR), traps the acoustic wave within a thin film structure. BAW filters offer superior Q factors, steep skirt selectivity, and stability at higher frequencies (into the tens of GHz), making them essential for high-performance duplexers and filters in modern, crowded spectrum environments like 4G and 5G cellular systems."
        },
        {
            "id": "1.4.6",
            "name": "Power Amplifiers",
            "description": "Power Amplifiers (PAs) are crucial components in the transmitter chain responsible for boosting the low-power processed RF signal to a sufficient magnitude for transmission via the antenna, overcoming significant path loss and meeting regulatory power limits. PA design involves complex trade-offs among high output power, voltage gain, operating efficiency, and linearity, as poor performance in these areas can lead to rapid battery drain, excessive heat generation, and signal distortion that causes spectral regrowth and adjacent channel interference."
        },
        {
            "id": "1.4.6.1",
            "name": "Efficiency",
            "description": "Efficiency in a Power Amplifier measures the ratio of the RF output power to the DC power consumed, determining the overall power wasted as heat and directly influencing the battery life and thermal management requirements of a communication system. Maximizing efficiency, often achieved through dynamic biasing techniques like Envelope Tracking (ET) or using switching classes (e.g., Class D, E, F) for constant envelope signals, is paramount, especially when handling high Peak-to-Average Power Ratio (PAPR) modulations common in modern systems."
        },
        {
            "id": "1.4.6.2",
            "name": "linearity",
            "description": "Linearity refers to the Power Amplifier's ability to amplify the input signal without introducing distortion, ensuring the modulated signal's spectral integrity is maintained. Non-linear operation generates unwanted spectral components, quantified by metrics like the third-order intercept point (IP3) and Adjacent Channel Power Ratio (ACPR), necessitating techniques like Digital Predistortion (DPD) to compensate for amplifier compression and maintain compliance with strict spectral masks."
        },
        {
            "id": "1.4.6.3",
            "name": "and thermal effects",
            "description": "Thermal effects relate to the consequences of heat generated within the Power Amplifier due to wasted DC power, directly impacting device reliability and electrical performance. High operating temperatures can shift transistor bias points, decrease gain, worsen linearity, and drastically reduce the lifetime of semiconductor devices, making robust thermal management—including optimized packaging, effective heat sinking, and temperature-aware biasing—a critical aspect of high-power RF design."
        },
        {
            "id": "1.4.7",
            "name": "Architectures",
            "description": "RF transceiver architectures define the configuration of essential components, including mixers, local oscillators, filters, and amplifiers, used to convert baseband signals up to radio frequency for transmission or down from RF to baseband for reception. The fundamental choices—such as superheterodyne versus direct conversion (Zero-IF/Low-IF)—dictate crucial system characteristics, including complexity, selectivity, power consumption, susceptibility to issues like image rejection and DC offset, and the overall level of integration achievable on a single chip."
        },
        {
            "id": "1.4.7.1",
            "name": "Direct conversion",
            "description": "Direct conversion, also known as Zero-IF (ZIF) architecture, converts the incoming RF signal directly down to the baseband frequency (centered at 0 Hz) using a single, high-frequency mixing stage. This architecture enables high integration and lower power consumption by eliminating bulky Intermediate Frequency (IF) filters, but its primary challenge lies in mitigating DC offset accumulation caused by local oscillator leakage and self-mixing, requiring sophisticated digital calibration techniques."
        },
        {
            "id": "1.4.7.2",
            "name": "superheterodyne",
            "description": "Superheterodyne architecture utilizes one or more intermediate frequency (IF) stages to convert the RF signal to a fixed, usually lower frequency before final demodulation, allowing for superior selectivity through fixed-frequency, high-Q filtering at the IF stage. Although resulting in higher complexity, greater component count, and increased power consumption compared to ZIF, the superheterodyne design offers excellent sensitivity and inherent immunity to DC offset issues, along with robust image frequency rejection capabilities."
        },
        {
            "id": "1.4.7.3",
            "name": "zero-IF",
            "description": "Zero-IF (ZIF) is a specialized direct conversion architecture where the Local Oscillator (LO) frequency is precisely matched to the incoming RF carrier frequency, mixing the RF signal down directly to 0 Hz (DC). This approach facilitates maximum integration and size reduction but makes the receiver highly vulnerable to DC offsets from LO leakage and demands stringent I/Q channel matching (amplitude and phase) to correctly reconstruct the complex baseband signal and avoid signal degradation."
        },
        {
            "id": "1.4.8",
            "name": "Testing",
            "description": "RF testing involves a comprehensive set of measurements performed on active and passive components and systems to verify performance specifications, quality assurance, and operational reliability across varying frequencies and power levels. This crucial process utilizes specialized instrumentation like Vector Network Analyzers (VNAs) and spectrum analyzers to characterize device behavior using metrics such as gain flatness, Noise Figure (NF), impedance matching (S11), and linearity (P1dB, IP3)."
        },
        {
            "id": "1.4.8.1",
            "name": "Gain flatness",
            "description": "Gain flatness is a critical measurement that quantifies the uniformity of amplification across the specified operating frequency bandwidth of a component, such as an amplifier or filter. Maintaining high gain flatness is essential for broadband modulated signals, as variations in gain across the spectrum can introduce amplitude distortion, leading to symbol errors and degraded demodulation performance."
        },
        {
            "id": "1.4.8.2",
            "name": "NF",
            "description": "Noise Figure (NF) is a measure of the degradation of the signal-to-noise ratio (SNR) as a signal passes through a device, quantifying the amount of excess noise added by the component itself relative to an ideal noise source. Minimizing NF is fundamentally important, especially in the receiver front-end (Low Noise Amplifier or LNA), because noise introduced early in the chain is amplified by all subsequent stages, limiting the receiver's sensitivity to weak incoming signals."
        },
        {
            "id": "1.4.8.3",
            "name": "linearity",
            "description": "Linearity testing in RF systems determines the point at which an active device’s output power ceases to increase proportionally with its input power, leading to compression and the generation of unwanted intermodulation products. Key linearity test metrics include the 1 dB compression point (P1dB), indicating the onset of gain compression, and the Third-Order Intercept Point (IP3), which models the severity of spectral distortion caused by mixing products falling into the operating band."
        },
        {
            "id": "1.4.8.4",
            "name": "and S11",
            "description": "S11 (input reflection coefficient) is one of the complex S-parameters measured via a VNA, specifically quantifying the impedance mismatch at a device's input port relative to the system characteristic impedance, typically 50 ohms. A test result with a low magnitude of S11 (often expressed as high Return Loss or low VSWR) indicates that minimal incident power is reflected back toward the source, ensuring maximum power transfer and minimizing potential standing wave issues."
        },
        {
            "id": "1.5.1",
            "name": "Free-space and Reflection",
            "description": "Line-of-sight and multipath."
        },
        {
            "id": "1.5.2",
            "name": "Fresnel Zones and Diffraction",
            "description": "Path clearance and shadowing."
        },
        {
            "id": "1.5.3",
            "name": "Ground and Sky Wave",
            "description": "Long-distance and atmospheric effects."
        },
        {
            "id": "1.5.4",
            "name": "Atmospheric and Rain Attenuation",
            "description": "Frequency-dependent losses (ITU models)."
        },
        {
            "id": "1.5.5",
            "name": "Urban and Indoor Models",
            "description": "Urban and Indoor Models are specialized propagation prediction tools designed to estimate signal path loss and coverage in environments characterized by dense structures, frequent obstructions, and highly dynamic multipath propagation, crucial for accurate network planning. These models incorporate mechanisms such as reflection, diffraction (e.g., around building corners), scattering, and wall penetration loss, providing more precise estimates than simple line-of-sight models in complex non-homogeneous environments."
        },
        {
            "id": "1.5.5.1",
            "name": "COST 231",
            "description": "COST 231 is an empirical path loss model that extends the applicability of the Hata model to higher frequencies (up to 2 GHz) and provides enhanced accuracy for predicting signal attenuation in dense urban and suburban macro-cellular environments. The prominent COST 231 Walfisch-Ikegami model is a refined version that specifically accounts for the effects of rooftop-to-street diffraction and is widely used for planning 2G and 3G networks."
        },
        {
            "id": "1.5.5.2",
            "name": "Hata",
            "description": "Hata is a widely used empirical propagation model derived from the extensive measurement data of the Okumura model, simplified into a set of formulas for calculating median path loss across frequencies from 150 MHz to 1500 MHz in macro-cellular systems. It incorporates specific adjustments based on whether the environment is classified as urban, suburban, or open rural, making it a foundational tool for initial large-scale network coverage planning."
        },
        {
            "id": "1.5.5.3",
            "name": "WINNER II",
            "description": "WINNER II (Wireless world Initiative NEw Radio) is an advanced, geometry-based stochastic channel model framework utilized for the simulation and testing of future wireless systems (4G and beyond) across diverse environments including urban, indoor, and vehicular scenarios. Unlike simpler models, WINNER II provides detailed statistical descriptions of key channel characteristics like delay spread, angular spread, and spatio-temporal correlation, which are vital for evaluating the performance of complex technologies such as MIMO and beamforming."
        },
        {
            "id": "1.5.6",
            "name": "Doppler and Mobility",
            "description": "Coherence time and Doppler spread."
        },
        {
            "id": "1.6.1",
            "name": "Antenna theory",
            "description": "Antenna Parameters are quantitative metrics used to characterize the operational performance and suitability of an antenna for a specific communication link or system. Essential parameters include gain (directional power increase), directivity, radiation pattern (defining spatial energy distribution), efficiency, polarization, operating bandwidth, and impedance matching (quantified by S11 or VSWR)."
        },
        {
            "id": "1.6.1",
            "name": "Antenna Parameters",
            "description": "Antenna Parameters are quantitative metrics used to characterize the operational performance and suitability of an antenna for a specific communication link or system. Essential parameters include gain (directional power increase), directivity, radiation pattern (defining spatial energy distribution), efficiency, polarization, operating bandwidth, and impedance matching (quantified by S11 or VSWR)."
        },
        {
            "id": "1.6.1.1",
            "name": "Gain",
            "description": "Gain is a measure of an antenna’s ability to concentrate transmitted or received energy in a specific direction relative to a hypothetical isotropic radiator (measured in dBi) or a reference dipole (measured in dBd); it is achieved through directional focusing rather than the addition of actual power, resulting in a higher Effective Isotropic Radiated Power (EIRP)."
        },
        {
            "id": "1.6.1.2",
            "name": "efficiency",
            "description": "efficiency is the ratio of the total power radiated by the antenna into space to the total power input to the antenna terminals, typically expressed as a percentage or a fraction, indicating how effectively the antenna converts electrical energy into electromagnetic waves while accounting for resistive losses, such as heat in the conductors and dielectrics."
        },
        {
            "id": "1.6.1.3",
            "name": "polarization",
            "description": "polarization describes the orientation of the electric field vector of the electromagnetic wave as it propagates in space, categorized primarily as linear (horizontal or vertical), circular (right-hand or left-hand), or elliptical, and matching the polarization between the transmitting and receiving antennas is essential for maximizing power transfer."
        },
        {
            "id": "1.6.1.4",
            "name": "impedance",
            "description": "impedance is the complex ratio of the voltage to the current at the antenna’s input port, ideally matched to the characteristic impedance of the transmission line (typically 50 Ohms) to minimize signal reflections, characterized by a resistive component and a reactive component, where a purely resistive match results in maximum power transfer."
        },
        {
            "id": "1.6.2",
            "name": "Antenna design",
            "description": "Antenna Types refers to the fundamental physical structures and architectures used to radiate electromagnetic energy, such as apertures, wires, microstrip patches, and arrays, where the specific type selected is optimized based on criteria like operating frequency, required physical size, environmental ruggedness, and desired directivity characteristics."
        },
        {
            "id": "1.6.2",
            "name": "Antenna Types",
            "description": "Antenna Types refers to the fundamental physical structures and architectures used to radiate electromagnetic energy, such as apertures, wires, microstrip patches, and arrays, where the specific type selected is optimized based on criteria like operating frequency, required physical size, environmental ruggedness, and desired directivity characteristics."
        },
        {
            "id": "1.6.2.1",
            "name": "Dipole",
            "description": "Dipole antennas consist of two conductive elements fed at the center, are resonant when the total length is approximately half a wavelength ($\\lambda/2$), and are fundamental structures known for their omnidirectional radiation pattern perpendicular to the elements and relatively broad bandwidth."
        },
        {
            "id": "1.6.2.2",
            "name": "patch",
            "description": "patch antennas are low-profile antennas fabricated typically using microstrip techniques, consisting of a metal patch over a ground plane separated by a dielectric substrate, known for their compact size, light weight, and ease of integration onto circuit boards, though they often exhibit narrow bandwidth."
        },
        {
            "id": "1.6.2.3",
            "name": "horn",
            "description": "horn antennas are aperture antennas created by flaring a waveguide to gradually transition the confined energy into free space, acting as an impedance transformer, and are widely used due to their high directivity, broad bandwidth, and reliability, often serving as feed elements for larger reflector systems or as calibrated standards."
        },
        {
            "id": "1.6.2.4",
            "name": "Yagi",
            "description": "Yagi antennas, or Yagi-Uda arrays, are highly directional antennas comprising a driven element, a longer reflector element, and one or more shorter director elements, where the parasitic elements interact to concentrate the electromagnetic energy into a narrow beam, achieving moderate to high gain along the axis of the directors."
        },
        {
            "id": "1.6.2.5",
            "name": "array",
            "description": "array antennas consist of multiple individual radiating elements arranged spatially, where the overall radiation pattern and performance are determined by the constructive and destructive interference of the signals, often using controlled phase shifts (phased arrays) to electronically steer the beam without mechanical movement."
        },
        {
            "id": "1.6.2.6",
            "name": "reflector",
            "description": "reflector antennas utilize a shaped, electrically large conductive surface, most commonly parabolic, to collect energy from a small primary feed element placed at the focal point and focus it into a highly concentrated, narrow, high-gain beam, essential for long-distance terrestrial and satellite communications."
        },
        {
            "id": "1.6.3",
            "name": "Matching and Baluns",
            "description": "Impedance matching for maximum power transfer."
        },
        {
            "id": "1.6.4",
            "name": "Radiation Pattern",
            "description": "Beamwidth and sidelobe control."
        },
        {
            "id": "1.6.5",
            "name": "Antenna Diversity and MIMO",
            "description": "Spatial diversity and correlation."
        },
        {
            "id": "1.6.6",
            "name": "Antenna Measurements",
            "description": "Antenna Measurements are systematic tests, often conducted in controlled environments like anechoic chambers, to characterize the actual performance parameters of the antenna, including its radiation pattern, absolute gain, beamwidth, polarization purity, and input impedance match (VSWR/S11) across the operating frequency band."
        },
        {
            "id": "1.6.6.1",
            "name": "Gain",
            "description": "Gain measurement determines the antenna's directivity efficiency by comparing its received or transmitted power density against a theoretical isotropic source or a calibrated standard antenna, typically requiring precise positioning and power level control in a far-field test range."
        },
        {
            "id": "1.6.6.2",
            "name": "pattern",
            "description": "pattern measurement characterizes the directional dependency of the radiation intensity of the antenna by plotting the electric field strength or power density versus angular position (azimuth and elevation), which reveals the main beam shape, beamwidth, and the levels of undesired sidelobes."
        },
        {
            "id": "1.6.6.3",
            "name": "VSWR",
            "description": "VSWR, or Voltage Standing Wave Ratio, is a dimensionless metric, typically measured as a ratio greater than 1:1, used to quantify the quality of the impedance match between the antenna and the transmission line, where high VSWR indicates significant power reflection back toward the source due to mismatch."
        },
        {
            "id": "1.6.6.4",
            "name": "and S11 testing",
            "description": "and S11 testing involves measuring the reflection coefficient ($\\Gamma$) at the input port of the antenna using a Vector Network Analyzer (VNA), where S11 quantifies the reflected power relative to the incident power in dB (return loss), providing a frequency-dependent measure that is mathematically convertible to VSWR."
        },
        {
            "id": "2.1.1",
            "name": "Core Formula",
            "description": "Pr = Pt + Gt + Gr − Lp − Lsys."
        },
        {
            "id": "2.1.2",
            "name": "Free Space Path Loss (FSPL)",
            "description": "Lfs = 32.4 + 20 log d + 20 log f."
        },
        {
            "id": "2.1.3",
            "name": "Fade Margin",
            "description": "Design margin for reliability."
        },
        {
            "id": "2.1.4",
            "name": "Link Tools",
            "description": "Spreadsheet and MATLAB simulations."
        },
        {
            "id": "2.2.1",
            "name": "Receiver Dynamic Range",
            "description": "Difference between MDS and max input."
        },
        {
            "id": "2.2.2",
            "name": "Nonlinearity Metrics",
            "description": "Nonlinearity Metrics are parameters used to quantify the unwanted signal distortion generated by active RF components, particularly amplifiers, when driven by high input power levels, characterizing the resulting intermodulation products (IM) and harmonic generation, which compromise spectral purity and signal integrity."
        },
        {
            "id": "2.2.2.1",
            "name": "P1dB",
            "description": "P1dB, the 1 dB Compression Point, defines the maximum output power level at which the gain of an active device has decreased by exactly 1 dB from its ideal linear small-signal gain, marking the point where the amplifier transitions from linear operation toward saturation and exhibits significant distortion."
        },
        {
            "id": "2.2.2.2",
            "name": "IP3",
            "description": "IP3, or Third-Order Intercept Point, is an extrapolated theoretical power level (input IP3 or output OIP3) where the power of the desired fundamental signals would hypothetically equal the power of the undesired third-order intermodulation products (IM3), serving as a critical figure of merit for spectral purity in multi-tone communication systems."
        },
        {
            "id": "2.2.2.3",
            "name": "SFDR",
            "description": "SFDR, or Spurious-Free Dynamic Range, is a critical figure of merit for systems involving signal conversion (like ADCs and mixers), quantifying the range between the power level of the fundamental signal and the power level of the highest spurious component (typically a harmonic or intermodulation product) in the output spectrum. A high SFDR signifies excellent linearity, ensuring that weak signals are not masked by internally generated noise and distortion products, which is crucial for maximizing signal fidelity, particularly in wideband or multi-carrier environments."
        },
        {
            "id": "2.2.3",
            "name": "Testing Methods",
            "description": "Two-tone and sweep measurements."
        },
        {
            "id": "2.3.1",
            "name": "Noise figure",
            "description": "Noise figure (NF) is a measure of the degradation of the signal-to-noise ratio (SNR) caused by a component or system, quantifying the noise contribution added by the device relative to the minimum theoretical thermal noise (kTB) at its input. Expressed as a ratio (F) or in decibels (NF), it is a fundamental metric for receiver design; lower NF values indicate superior noise performance and are essential for maximizing receiver sensitivity and dynamic range."
        },
        {
            "id": "2.3.2",
            "name": "cascaded effects",
            "description": "Cascaded effects describe how performance parameters, primarily gain, noise figure, and linearity (IP3), combine when multiple RF stages are connected in series. The Friis formulas govern these effects, showing that the overall system noise figure is heavily dominated by the noise and gain of the first stage, while the system's linearity (IP3) is often constrained by the lowest compression point occurring in subsequent high-gain stages."
        },
        {
            "id": "2.3.2",
            "name": "Thermal Noise",
            "description": "Cascaded effects describe how performance parameters, primarily gain, noise figure, and linearity (IP3), combine when multiple RF stages are connected in series. The Friis formulas govern these effects, showing that the overall system noise figure is heavily dominated by the noise and gain of the first stage, while the system's linearity (IP3) is often constrained by the lowest compression point occurring in subsequent high-gain stages."
        },
        {
            "id": "2.3.3",
            "name": "measurement",
            "description": "Measurement in RF engineering involves the precise characterization of components and system performance parameters, utilizing specialized instrumentation like VNAs, spectrum analyzers, and noise figure meters, to ensure designs meet specification and standards. Key parameters measured include gain, impedance matching (S-parameters), power output (P1dB), noise figure, and spectral purity (harmonics and spurious emissions), forming the basis for design verification and quality control."
        },
        {
            "id": "2.3.3",
            "name": "Friis Formula",
            "description": "Measurement in RF engineering involves the precise characterization of components and system performance parameters, utilizing specialized instrumentation like VNAs, spectrum analyzers, and noise figure meters, to ensure designs meet specification and standards. Key parameters measured include gain, impedance matching (S-parameters), power output (P1dB), noise figure, and spectral purity (harmonics and spurious emissions), forming the basis for design verification and quality control."
        },
        {
            "id": "2.3.4",
            "name": "Measurement Methods",
            "description": "Measurement Methods are standardized procedures used to accurately determine the performance metrics of RF circuits, specifically utilizing established test setups and calibration techniques to isolate the Device Under Test (DUT) characteristics from the measurement equipment limitations. These methods include two-port calibration for S-parameters, the intercept method for linearity, and the Y-factor method for noise figure."
        },
        {
            "id": "2.3.4.1",
            "name": "Y-factor",
            "description": "The Y-factor method is a highly accurate technique for measuring noise figure by comparing the output noise power of the DUT when terminated with a calibrated \"hot\" noise source versus a \"cold\" noise source. The ratio of these two measured output noise powers, the Y-factor, is then used along with the known Excess Noise Ratio (ENR) of the sources to calculate the noise figure of the DUT."
        },
        {
            "id": "2.3.4.2",
            "name": "noise diode",
            "description": "A noise diode is a specially designed semiconductor device, often an avalanche diode, used as a calibrated, stable, broadband noise source in RF measurements, particularly for determining noise figure via the Y-factor method. When properly biased, the diode generates a known level of white Gaussian noise, providing the defined \"hot\" input temperature necessary to calculate the Noise Figure of a system."
        },
        {
            "id": "2.4.1",
            "name": "Intermodulation Distortion",
            "description": "3rd and 5th order products."
        },
        {
            "id": "2.4.2",
            "name": "Blocking Performance",
            "description": "Adjacent channel immunity."
        },
        {
            "id": "2.4.3",
            "name": "ACPR Measurement",
            "description": "Output spectral purity."
        },
        {
            "id": "2.5.1",
            "name": "PA Efficiency",
            "description": "PAE and drain efficiency."
        },
        {
            "id": "2.5.2",
            "name": "Thermal Management",
            "description": "Heat sinks and derating."
        },
        {
            "id": "2.5.3",
            "name": "Envelope Tracking",
            "description": "Doherty and supply modulation."
        },
        {
            "id": "2.6.1",
            "name": "Matching Networks",
            "description": "Matching Networks are passive circuits constructed from lumped elements (L, C) or transmission lines, designed to transform a complex load impedance to a desired source impedance, typically $50\\Omega$, to ensure maximum power transfer (conjugate matching) and minimize signal reflections. Proper matching is essential for achieving optimal gain, efficiency, and stability in RF circuits."
        },
        {
            "id": "2.6.1.1",
            "name": "L",
            "description": "The L-network is the simplest impedance matching structure, consisting of only two reactive components (one series, one shunt) arranged in an L-configuration, capable of transforming any impedance to any other impedance. Because it has only two degrees of freedom, the Quality factor (Q) of the network is uniquely determined by the input and output impedances being matched."
        },
        {
            "id": "2.6.1.2",
            "name": "π",
            "description": "The $\\pi$ network uses three reactive components—two in shunt and one in series—offering greater versatility than the L-network by providing two independent degrees of freedom. This allows the designer to achieve the desired impedance transformation while also controlling the loaded Quality factor (Q) of the network, which is useful for setting bandwidth or providing harmonic suppression."
        },
        {
            "id": "2.6.1.3",
            "name": "and T network design",
            "description": "The T network design is the dual topology to the $\\pi$ network, featuring two series reactive elements and one shunt reactive element, and it similarly provides two degrees of freedom for design. This structure enables the designer to achieve the required impedance transformation while independently controlling the circuit’s loaded Q-factor, making it particularly useful in high-Q filtering applications or high-impedance environments."
        },
        {
            "id": "2.6.2",
            "name": "Smith Chart",
            "description": "Visualization of impedance and reflection."
        },
        {
            "id": "2.6.3",
            "name": "Stability Criteria",
            "description": "Stability Criteria are mathematical conditions derived from the S-parameters of an active two-port network (like an amplifier) that determine whether the device will remain stable or oscillate under various passive source and load impedance terminations. These criteria are essential for preventing spurious oscillations that can arise when the circuit's input or output impedance presents a negative real resistance to the source or load."
        },
        {
            "id": "2.6.3.1",
            "name": "Rollet’s K",
            "description": "Rollet’s K factor is a primary stability criterion; if the calculated K value is greater than unity ($K>1$) and the magnitude of the S-parameter determinant $|\\Delta|$ is less than unity, the active circuit is deemed unconditionally stable at that frequency, meaning it will not oscillate regardless of the passive source or load impedance."
        },
        {
            "id": "2.6.3.2",
            "name": "μ-factor",
            "description": "The $\\mu$-factor (Mu-factor) is an alternative, single-variable stability criterion that provides a geometrically robust measure of unconditional stability, often preferred for its numerical reliability near the boundary of stability. If the $\\mu$-factor is greater than one ($\\mu>1$), the device is unconditionally stable, indicating the Smith Chart is entirely free of potential oscillation regions."
        },
        {
            "id": "2.6.4",
            "name": "Stability Circles",
            "description": "Feedback and oscillation control."
        },
        {
            "id": "3.1.1",
            "name": "Occupied Bandwidth (OBW)",
            "description": "99% power bandwidth."
        },
        {
            "id": "3.1.2",
            "name": "ACPR/ACLR",
            "description": "Adjacent channel leakage."
        },
        {
            "id": "3.1.3",
            "name": "Harmonics & Spurious",
            "description": "Compliance with spectral limits."
        },
        {
            "id": "3.1.4",
            "name": "Phase Noise",
            "description": "Frequency stability and jitter."
        },
        {
            "id": "3.2.1",
            "name": "Sensitivity",
            "description": "Sensitivity is the minimum input signal power level (measured in dBm) required by a receiver to achieve a specific quality threshold at its output, most commonly defined by a minimum acceptable Signal-to-Noise Ratio (SNR) or a maximum tolerable Bit Error Rate (BER). It is fundamentally limited by the system's thermal noise floor and the cumulative noise figure of the receiver chain."
        },
        {
            "id": "3.2.2",
            "name": "selectivity",
            "description": "Selectivity is the measure of a receiver's ability to isolate and process a desired signal while effectively rejecting adjacent channel interference (ACI) and other unwanted signals that are close in frequency. This performance is primarily governed by the steepness and rejection bandwidth characteristics of the receiver’s filters, typically located at the RF and Intermediate Frequency (IF) stages."
        },
        {
            "id": "3.2.3",
            "name": "blocking",
            "description": "Blocking describes the detrimental effect where a strong, out-of-band interfering signal saturates or pushes the receiver's low-noise amplifier (LNA) or mixer into its non-linear operating region, leading to desensitization. This compression drastically reduces the gain and signal handling capability available for the much weaker desired signal, effectively masking it."
        },
        {
            "id": "3.2.4",
            "name": "Desensitization",
            "description": "In-band interference effects."
        },
        {
            "id": "3.3.1",
            "name": "BER vs Eb/N0",
            "description": "Performance curves."
        },
        {
            "id": "3.3.2",
            "name": "EVM",
            "description": "Error vector magnitude."
        },
        {
            "id": "3.3.3",
            "name": "Constellation Analysis",
            "description": "IQ scatter visualization."
        },
        {
            "id": "3.3.4",
            "name": "Eye Diagram",
            "description": "Timing and jitter analysis."
        },
        {
            "id": "3.4.1",
            "name": "Throughput",
            "description": "Measured data rate."
        },
        {
            "id": "3.4.2",
            "name": "Latency and Jitter",
            "description": "Timing consistency."
        },
        {
            "id": "3.4.3",
            "name": "Reliability",
            "description": "Reliability in RF communications refers to the probability that a wireless link or device will maintain its specified performance metrics, such as connection stability and data throughput, over a required period and under expected operating conditions, accounting for factors like fading, component aging, and transient interference. High reliability often demands robust power control and error correction coding schemes."
        },
        {
            "id": "3.4.3.1",
            "name": "PER",
            "description": "PER, or Packet Error Rate, is a key link-layer metric defined as the ratio of incorrectly received data packets to the total number of packets transmitted over the channel. A high PER indicates poor link quality, generally caused by low SNR or excessive interference, necessitating retransmissions which consequently reduce the effective data throughput."
        },
        {
            "id": "3.4.3.2",
            "name": "FER",
            "description": "FER, or Frame Error Rate, is a physical layer reliability metric defined as the percentage of transmitted data frames (larger blocks of information than packets, frequently used in cellular and standardizing contexts) that are corrupted or contain errors upon reception. It is a critical KPI for assessing the performance of the physical channel and the efficacy of forward error correction (FEC) coding mechanisms."
        },
        {
            "id": "3.4.3.3",
            "name": "link availability",
            "description": "link availability Link availability refers to the percentage of time during a specified period that an RF communication link meets or exceeds the minimum acceptable performance threshold, usually defined by a maximum allowable Bit Error Rate (BER) or minimum Signal-to-Noise Ratio (SNR). It is a critical metric for system design, calculated based on the available link margin, taking into account statistical propagation impairments such as rain fade, atmospheric absorption, multipath fading, and interference, often targeted at demanding levels like 99.999%."
        },
        {
            "id": "3.5.1",
            "name": "AM-AM",
            "description": "AM-AM AM-AM (Amplitude Modulation to Amplitude Modulation conversion) describes a non-linear effect in RF power amplifiers where an increase in the input signal power causes a reduction in the amplifier's effective gain (gain compression), meaning the output amplitude is no longer linearly proportional to the input amplitude. This compression distorts the envelope of the modulated signal, introducing self-interference and spectral regrowth, which is especially detrimental to high-order QAM and OFDM systems."
        },
        {
            "id": "3.5.2",
            "name": "AM-PM",
            "description": "AM-PM AM-PM (Amplitude Modulation to Phase Modulation conversion) is a non-linear distortion where changes in the amplitude of the input RF signal cause unintended corresponding shifts in the phase of the output signal. This effect is caused by the dependence of active device junction capacitances or transit times on the instantaneous input voltage, severely degrading the accuracy of phase-sensitive modulation schemes and resulting in high Error Vector Magnitude (EVM)."
        },
        {
            "id": "3.5.3",
            "name": "IMD",
            "description": "IMD Intermodulation Distortion (IMD) occurs when two or more distinct frequencies ($\\text{f}_1, \\text{f}_2$) pass through a non-linear device, resulting in the creation of spurious output frequencies that are linear combinations of the input frequencies ($m\\text{f}_1 \\pm n\\text{f}_2$). Third-order intermodulation products ($\\text{IM}_3$) are the most problematic because they fall close to the desired operational bandwidth, leading to unwanted spectral energy, receiver desensitization, and adjacent channel interference."
        },
        {
            "id": "3.6.1",
            "name": "Group delay",
            "description": "Group delay Group delay is the measure of the time delay experienced by the modulation envelope (the group of frequencies surrounding the carrier) as it propagates through a device or channel, defined mathematically as the negative derivative of the phase shift with respect to angular frequency ($\\tau_g = -d\\phi/d\\omega$). For distortionless transmission, the group delay must be constant across the signal bandwidth; any deviation indicates non-linear phase response."
        },
        {
            "id": "3.6.2",
            "name": "envelope delay distortion",
            "description": "envelope delay distortion Envelope delay distortion is the condition where the group delay is not constant across the signal bandwidth, meaning different frequency components within the signal envelope experience different transmission times. This varying time delay causes the pulse shape to spread out or become distorted, leading to temporal smearing of symbols and resulting in intersymbol interference (ISI), particularly challenging in wideband high-speed data links."
        },
        {
            "id": "4.1.1",
            "name": "Spectrum analyzer",
            "description": "Spectrum analyzer A spectrum analyzer is an electronic test instrument that measures and graphically displays the magnitude (power level) of an input signal as a function of frequency, effectively translating the signal into the frequency domain. It is fundamentally used to characterize spectral purity, measure occupied bandwidth, quantify harmonics and spurious emissions, and assess interference and noise floor levels in RF systems."
        },
        {
            "id": "4.1.2",
            "name": "VNA",
            "description": "VNA A Vector Network Analyzer (VNA) is a specialized test instrument used to measure the S-parameters (scattering parameters) of passive and active RF components, quantifying how power is reflected, absorbed, and transmitted by a device under test (DUT). Crucially, the VNA measures both the magnitude and phase of these parameters, enabling precise characterization of impedance matching, phase linearity, gain, and return loss up to millimeter-wave frequencies."
        },
        {
            "id": "4.1.3",
            "name": "generator",
            "description": "generator An RF signal generator, often a Vector Signal Generator (VSG), is an instrument used to produce highly controlled and precise electromagnetic waves, ranging from continuous wave (CW) tones to complex, digitally modulated waveforms (e.g., QAM, OFDM). These generated signals are essential for stimulating components, characterizing receiver sensitivity, testing link budgets, and validating demodulator performance in controlled laboratory environments."
        },
        {
            "id": "4.1.4",
            "name": "oscilloscope",
            "description": "oscilloscope An oscilloscope is a primary time-domain measurement tool that visualizes voltage or current changes over time, displaying the waveform shape, amplitude, and temporal characteristics. In modern RF testing, high-bandwidth digital oscilloscopes are used for baseband signal analysis, timing analysis of digital interfaces, and, when paired with downconverters, for deep acquisition and analysis of modulated waveforms and transient RF events."
        },
        {
            "id": "4.2.1",
            "name": "Anechoic",
            "description": "Anechoic The term anechoic describes a chamber or test environment that is deliberately designed to absorb electromagnetic energy, thus minimizing or eliminating reflections from walls, floor, and ceiling. Anechoic chambers simulate \"free space\" conditions, making them essential for accurate, repeatable Over-The-Air (OTA) measurements such as antenna radiation patterns, Effective Isotropic Radiated Power (EIRP), and radiated susceptibility testing."
        },
        {
            "id": "4.2.2",
            "name": "conducted",
            "description": "conducted Conducted testing refers to the measurement of RF signals and characteristics that are contained and channeled through physical transmission media, such as coaxial cables, waveguides, or PCB traces, directly connecting the device under test (DUT) to the instrumentation. This method isolates component-level performance, allowing precise measurement of metrics like S-parameters, noise figure, and linearity without the complicating variables of the air interface."
        },
        {
            "id": "4.2.3",
            "name": "OTA",
            "description": "OTA Over-The-Air (OTA) testing involves characterizing the performance of a complete wireless device by measuring its integrated radiated characteristics, including the combined efficiency of the antenna, RF front end, and system software. Critical OTA metrics include Total Radiated Power (TRP) and Total Isotropic Sensitivity (TIS), which quantify how well the device transmits and receives signals in a realistic spatial environment."
        },
        {
            "id": "4.2.4",
            "name": "environmental",
            "description": "environmental Environmental testing in RF communication involves subjecting wireless equipment to controlled extremes of non-electrical stress factors, such as high/low temperature, humidity, vibration, or shock, while simultaneously monitoring RF performance metrics like output power or link quality. This process ensures the operational reliability and resilience of the equipment when deployed in harsh or real-world operating conditions outside of a climate-controlled lab."
        },
        {
            "id": "4.3.1",
            "name": "SCPI",
            "description": "SCPI SCPI (Standard Commands for Programmable Instruments) is a common, ASCII-based language standard used for remotely controlling and automating test and measurement equipment via interfaces like GPIB, Ethernet, or USB. It provides a consistent, hierarchical command syntax, allowing engineers to write scripts that can configure instruments, initiate measurements, and retrieve data regardless of the specific vendor or model of the device."
        },
        {
            "id": "4.3.2",
            "name": "PyVISA",
            "description": "PyVISA PyVISA is an open-source Python package that provides an easy-to-use, standardized interface for controlling various types of scientific and engineering instruments using the Virtual Instrument Software Architecture (VISA) framework. It abstracts the complexities of the underlying physical communication protocols (like GPIB, USBTMC, or Ethernet Sockets), enabling rapid development of automated testing sequences using Python scripting."
        },
        {
            "id": "4.3.3",
            "name": "LabVIEW",
            "description": "LabVIEW LabVIEW (Laboratory Virtual Instrument Engineering Workbench) is a highly specialized graphical system design platform from NI (National Instruments) that uses a visual \"block diagram\" programming paradigm for data acquisition, instrument control, and measurement automation. It is widely utilized in RF testing due to its strong integration with PXI modular instrumentation and its ability to create complex, real-time user interfaces for test management and data analysis."
        },
        {
            "id": "4.3.4",
            "name": "HIL",
            "description": "HIL Hardware-in-the-Loop (HIL) is a testing methodology where actual physical hardware, such as an RF transceiver or digital modem, is connected to a sophisticated simulator that replicates the real-world communication channel and environment in real time. This technique allows designers to validate the performance of the DUT under conditions—like complex fading, high interference, or specific mobility scenarios—that are too dangerous, expensive, or difficult to reproduce live."
        },
        {
            "id": "4.5.1",
            "name": "Beamforming",
            "description": "Beamforming Beamforming is an advanced signal processing technique applied to antenna arrays where the phase and amplitude of signals transmitted or received by each element are weighted and combined to create a constructive interference pattern focused in a specific direction. This spatial filtering technique dramatically increases the effective radiated power (EIRP) towards the intended receiver while minimizing interference to others, central to achieving high spectral efficiency in MIMO and 5G/6G systems."
        },
        {
            "id": "4.5.2",
            "name": "OTA chamber",
            "description": "OTA chamber An Over-The-Air (OTA) chamber is a specialized, usually anechoic, shielded enclosure designed to facilitate the measurement of the integrated radiated performance of wireless devices without physical connections. These chambers employ carefully calibrated antenna setups, precise positioners (turntables), and measurement equipment to characterize parameters such as Total Radiated Power (TRP), Total Isotropic Sensitivity (TIS), and 3D radiation patterns accurately."
        },
        {
            "id": "4.5.3",
            "name": "channel sounding",
            "description": "channel sounding The process of measuring and characterizing the physical propagation environment between a transmitter and a receiver by transmitting known probe signals and analyzing the received signals. This provides essential data regarding the channel impulse response, power delay profile, path loss, delay spread, and Doppler shift, which are critical inputs for optimizing advanced communication techniques like adaptive equalization, pre-coding, and beamforming weights."
        },
        {
            "id": "5.3.1",
            "name": "3GPP",
            "description": "3GPP The Third Generation Partnership Project is a global collaboration of standards organizations that develops specifications for globally applicable mobile broadband technologies, including GSM, UMTS, LTE, and 5G (New Radio). 3GPP is responsible for defining the core network architecture, radio access technology (RAN) interfaces, and complex protocol layer stacks necessary to ensure the interoperability and forward evolution of cellular systems worldwide."
        },
        {
            "id": "5.3.2",
            "name": "IEEE",
            "description": "IEEE The Institute of Electrical and Electronics Engineers is a global professional organization that develops standards across various technological domains, with its 802 committee being highly influential in RF communications. Key IEEE standards include the 802.11 family (Wi-Fi), 802.15 (WPAN/Bluetooth), and standards for Ethernet and wired networks, defining the physical and MAC layer operation of wireless local and metropolitan area networks."
        },
        {
            "id": "5.3.3",
            "name": "FCC",
            "description": "FCC The U.S. Federal Communications Commission is the independent government agency that regulates interstate and international communications in the United States, including managing the allocation of the radio frequency spectrum. The FCC enforces strict rules regarding RF device certification, maximum power output limits, spurious emissions, and licensing requirements to prevent interference and promote efficient, orderly use of the public airwaves."
        },
        {
            "id": "5.3.4",
            "name": "ETSI conformance",
            "description": "ETSI conformance Conformance refers to the demonstration that a wireless device or communication protocol adheres strictly to the mandatory technical standards and testing specifications established by the European Telecommunications Standards Institute (ETSI). Achieving ETSI conformance is required for equipment intended to be deployed and legally operated within the European market, ensuring interoperability, quality of service, and adherence to regional regulatory frameworks."
        },
        {
            "id": "5.4.1",
            "name": "Drive testing",
            "description": "Drive testing A methodology used to empirically assess the real-world performance, quality, and coverage of a mobile cellular network by collecting key metrics while driving through the service area using specialized monitoring equipment. Data collected typically includes received signal strength (RSRP), interference levels (SINR), throughput, handover success rates, and dropped call rates, which are then used for network optimization and planning."
        },
        {
            "id": "5.4.2",
            "name": "spectrum scanning",
            "description": "spectrum scanning The process of systematically monitoring and analyzing radio frequency activity across a defined range of frequencies using a spectrum analyzer or specialized scanning receiver. This technique is crucial for identifying active transmitters, measuring spectral occupancy, locating sources of interference, verifying regulatory compliance of existing systems, and gathering intelligence about the radio environment."
        },
        {
            "id": "5.5.1",
            "name": "MTBF",
            "description": "MTBF Mean Time Between Failures is a reliability metric representing the predicted average time expected to elapse between inherent failures of a system or component during normal operation. In critical RF infrastructure like base stations or satellite transponders, a high MTBF indicates hardware robustness and longevity, minimizing maintenance costs and ensuring consistent network uptime."
        },
        {
            "id": "5.5.2",
            "name": "telemetry",
            "description": "telemetry The automated process of measuring physical or performance parameters at a remote source and transmitting that data, often via an RF link, back to a central receiving station for recording and analysis. Telemetry is essential for monitoring the operational status of satellites, remote weather stations, industrial IoT sensors, and distant communications infrastructure."
        },
        {
            "id": "5.5.3",
            "name": "predictive maintenance",
            "description": "predictive maintenance A data-driven maintenance strategy utilizing continuous monitoring, sensor readings, and analytical algorithms (often leveraging telemetry data) to anticipate equipment failure before it occurs. For complex RF systems, this allows operators to schedule proactive maintenance on components like power amplifiers or antennas precisely when early signs of degradation are detected, maximizing operational efficiency and reducing unexpected downtime."
        },
        {
            "id": "6.1.1",
            "name": "Spatial multiplexing",
            "description": "Spatial multiplexing A key Multiple-Input Multiple-Output (MIMO) technique where independent, unique data streams are simultaneously transmitted over the same frequency channel using distinct transmit antennas. By exploiting the spatial dimension created by uncorrelated propagation paths (multipath), the receiver can separate the streams, thereby linearly increasing the spectral efficiency and capacity of the wireless link."
        },
        {
            "id": "6.1.2",
            "name": "CSI",
            "description": "CSI Channel State Information is the knowledge describing how a transmitted RF signal propagates from the transmitter to the receiver, including the effects of fading, scattering, and power attenuation. Accurate CSI is fundamentally necessary for advanced wireless systems, enabling optimization techniques like adaptive modulation and coding, beamforming, and spatial multiplexing to maximize throughput and link reliability."
        },
        {
            "id": "6.1.3",
            "name": "beamforming",
            "description": "beamforming A technique that focuses radiated or received RF energy in a specific spatial direction by applying precise phase and amplitude weights across elements of an antenna array. This results in significant array gain, enhancing the signal-to-interference-plus-noise ratio (SINR) for the intended user while minimizing power radiated elsewhere, making it central to high-frequency and massive MIMO deployments."
        },
        {
            "id": "6.10",
            "name": "TBD",
            "description": "MISSING"
        },
        {
            "id": "6.10.1",
            "name": "Channel emulation",
            "description": "Channel emulation The laboratory replication of real-world wireless propagation phenomena, such as fading, multipath delay spread, time variance (Doppler), and path loss, using specialized hardware called channel sounders or emulators. This controlled simulation environment allows engineers to rigorously test and validate the performance of complex communication algorithms, protocols, and hardware under repeatable, realistic RF conditions."
        },
        {
            "id": "6.10.2",
            "name": "DSP",
            "description": "DSP Digital Signal Processing involves the application of mathematical algorithms to sampled and digitized signals to perform essential communication functions. In RF systems, DSP handles baseband operations including modulation, demodulation, filtering, equalization, error correction coding, and implementation of complex antenna array techniques, forming the computational core of Software Defined Radios (SDR)."
        },
        {
            "id": "6.10.3",
            "name": "hardware-in-loop",
            "description": "hardware-in-loop A simulation methodology where a physical hardware component, such as an ASIC or an RF front-end, is connected and integrated directly into a real-time, closed-loop simulation environment, often involving channel emulation or complex protocol stacks running on a simulator. This allows for the rigorous testing and validation of the hardware’s performance and interactions under realistic operational stresses before deployment."
        },
        {
            "id": "6.11.1",
            "name": "LEO/GEO links",
            "description": "LEO/GEO links RF communication pathways involving satellites in Low Earth Orbit (LEO) or Geostationary Orbit (GEO). LEO links offer low latency due to shorter distances but require continuous beam handover and tracking, while GEO links provide continuous coverage over vast areas but suffer from high latency and significant path loss due to the 36,000 km distance."
        },
        {
            "id": "6.11.2",
            "name": "Doppler",
            "description": "Doppler The apparent shift in the frequency of an RF carrier signal caused by the relative motion between the transmitter and the receiver, proportionally changing with relative velocity. High Doppler shifts are a critical challenge in high-mobility wireless scenarios (e.g., high-speed rail or LEO satellite links) as they necessitate precise estimation and compensation techniques in the receiver to maintain signal coherence and successful demodulation."
        },
        {
            "id": "6.11.3",
            "name": "rain fade",
            "description": "rain fade The significant atmospheric attenuation of an RF signal, primarily impacting microwave and millimeter-wave frequencies (above 10 GHz), caused by the absorption and scattering of electromagnetic energy by heavy rain, snow, or wet ice. This effect drastically reduces the signal strength (SNR) and is a primary consideration in designing link budgets for high-frequency terrestrial and satellite backhaul systems."
        },
        {
            "id": "6.12.1",
            "name": "6G",
            "description": "6G The anticipated sixth generation of mobile communication technology, currently under research, aiming to evolve beyond 5G by achieving unprecedented data rates (Terabit-per-second), extremely low latency (microsecond), and massive connectivity. Key technological pillars include the utilization of sub-Terahertz spectrum, pervasive integration of Artificial Intelligence, and the development of integrated sensing and communication capabilities."
        },
        {
            "id": "6.12.2",
            "name": "short-range",
            "description": "short-range Pertains to wireless communication systems designed for localized coverage, typically spanning tens of meters or less, characterized by low power consumption and high data rates, commonly seen in technologies like Bluetooth, NFC, and specific WLAN deployments where proximity minimizes path loss and enhances link reliability."
        },
        {
            "id": "6.12.3",
            "name": "spectroscopy",
            "description": "spectroscopy In an RF context, this involves analyzing the spectral content of signals to identify and characterize materials or chemical compositions based on their interaction, such as absorption or reflection, with specific radio frequencies, providing non-invasive sensing capabilities, often used in specialized sensing applications beyond typical communications."
        },
        {
            "id": "6.13.1",
            "name": "Physical-layer security",
            "description": "Physical-layer security A security paradigm that leverages the intrinsic properties of the wireless propagation channel, such as noise, fading, and reciprocity, to secure communications against passive eavesdroppers without relying solely on higher-layer cryptographic protocols, often utilizing techniques like artificial noise injection or directional transmission."
        },
        {
            "id": "6.13.2",
            "name": "LPI",
            "description": "LPI Refers to techniques used primarily in military or specialized communications designed to make signals difficult to detect and characterize by unauthorized recipients, typically achieved through spread spectrum methods like frequency hopping or direct sequence, combined with low transmit power and precise spatial beamforming."
        },
        {
            "id": "6.13.3",
            "name": "QKD",
            "description": "QKD A method utilizing quantum mechanics principles to establish highly secure cryptographic keys between two parties, ensuring that any eavesdropping attempt fundamentally alters the transmitted quantum state, thereby immediately revealing the intrusion and making the key distribution provably secure against future computational advances."
        },
        {
            "id": "6.14.1",
            "name": "RIS design",
            "description": "RIS design Involves engineering passive or semi-passive surfaces composed of numerous reflection elements, each capable of independently adjusting the phase and/or amplitude of incident electromagnetic waves, enabling programmable wireless environments to dynamically focus signal energy, mitigate deep fades, and enhance coverage efficiency."
        },
        {
            "id": "6.14.2",
            "name": "beam steering",
            "description": "beam steering The process of electronically controlling the direction of the main lobe of an antenna's radiation pattern without physically moving the antenna, typically achieved using controllable phase shifters in a phased array system to focus radiated energy precisely toward a specific receiver, maximizing signal strength and minimizing inter-user interference."
        },
        {
            "id": "6.15.1",
            "name": "Phase noise",
            "description": "Phase noise A form of noise that manifests as random fluctuations in the phase of a signal, particularly generated by non-ideal oscillators and synthesizers, which smears the spectral energy around the desired carrier frequency and degrades the achievable signal-to-noise ratio and bit error rate in high-order modulation schemes."
        },
        {
            "id": "6.15.2",
            "name": "LO leakage",
            "description": "LO leakage Occurs in frequency converters, specifically mixers, where the signal from the Local Oscillator inadvertently couples into the RF port and radiates out of the transmitter antenna or contaminates the input of the receiver chain, often resulting in unwanted spurious emissions or significant DC offsets in direct-conversion architectures."
        },
        {
            "id": "6.15.3",
            "name": "compensation",
            "description": "compensation In RF systems, this refers to techniques used to counteract or mitigate various impairments like non-linearity, phase noise, frequency offset, or channel fading, often implemented through digital signal processing algorithms such as pre-distortion or equalization to restore signal integrity and optimize system performance."
        },
        {
            "id": "6.2.1",
            "name": "CQI",
            "description": "CQI A metric reported by the User Equipment back to the base station quantifying the quality of the downlink channel based on measurements like SINR, which allows the scheduler to dynamically select the optimal Modulation and Coding Scheme (MCS) for subsequent transmissions, maximizing throughput efficiency."
        },
        {
            "id": "6.2.2",
            "name": "HARQ",
            "description": "HARQ A sophisticated error control method combining traditional retransmission requests (ARQ) with Forward Error Correction (FEC) coding, where received data is stored in a buffer and soft-combined with subsequent retransmitted packets to maximize the probability of successful decoding, significantly improving link reliability."
        },
        {
            "id": "6.2.3",
            "name": "LDPC",
            "description": "LDPC A highly efficient linear block code characterized by a sparse parity-check matrix, known for achieving performance very close to the Shannon limit, which has been adopted as the primary data channel coding scheme in standards like 5G NR due to its excellent parallelism and high-throughput decoding capabilities."
        },
        {
            "id": "6.2.4",
            "name": "Turbo",
            "description": "Turbo A powerful iterative parallel concatenated convolution code (PCCC) that achieves near-Shannon-limit performance, widely adopted in 3G and 4G wireless standards, notable for utilizing two constituent encoders separated by a proprietary interleaver and employing soft-input/soft-output decoding techniques."
        },
        {
            "id": "6.2.5",
            "name": "Polar",
            "description": "Polar A channel coding scheme based on the principle of channel polarization, which optimally transforms a set of independent channels into a subset of either noise-free channels or purely noisy channels, making it highly efficient for error correction; it is specifically mandated for the control channels in 5G NR systems."
        },
        {
            "id": "6.4.1",
            "name": "Modulation recognition",
            "description": "Modulation recognition The process, often automated using machine learning or statistical signal processing techniques, of identifying the specific modulation scheme used by an unknown incoming RF signal without explicit prior knowledge of the transmitter, crucial for signal intelligence, spectrum monitoring, and cognitive radio systems."
        },
        {
            "id": "6.4.2",
            "name": "channel prediction",
            "description": "channel prediction In communication systems, this involves estimating the future state of the wireless channel, such as future Channel State Information (CSI), based on past measurements and known mobility models, enabling proactive resource allocation, precoding adjustments, and optimization of coding before deep fades occur."
        },
        {
            "id": "6.5.1",
            "name": "Pulse",
            "description": "Pulse A radar technique characterized by transmitting short, high-power electromagnetic energy bursts, measuring the time delay of the reflected return signal to precisely determine the target range, generally utilizing a high peak power but maintaining a very low duty cycle to achieve long detection ranges."
        },
        {
            "id": "6.5.2",
            "name": "FMCW",
            "description": "FMCW A radar technique where the transmitted signal is a continuous wave whose frequency is linearly varied over time, or chirped, allowing highly accurate determination of both target range and velocity simultaneously by mixing the received and transmitted signals to measure the resulting beat frequency."
        },
        {
            "id": "6.5.3",
            "name": "MIMO radar",
            "description": "MIMO radar A system that employs multiple transmit antennas and multiple receive antennas to transmit orthogonal waveforms, creating multiple virtual apertures, which significantly enhances the achievable angular resolution and improves target detection and parameter estimation capabilities compared to traditional phased arrays by leveraging spatial diversity."
        },
        {
            "id": "6.5.4",
            "name": "CFAR",
            "description": "CFAR Constant False Alarm Rate (CFAR) is a crucial signal processing algorithm used predominantly in radar systems to automatically adjust the detection threshold based on the measured local background noise, clutter, and interference power, ensuring that the probability of declaring a false target remains consistent and optimally low across various operating environments and clutter conditions."
        },
        {
            "id": "6.6.1",
            "name": "ES",
            "description": "ES Electronic Support (ES) constitutes the passive element of Electronic Warfare (EW), involving actions taken to search for, intercept, identify, and locate sources of radiated electromagnetic energy, such as enemy radar or communications transmissions, primarily for the purposes of threat warning, target acquisition, and gathering operational intelligence without actively transmitting energy."
        },
        {
            "id": "6.6.2",
            "name": "EA",
            "description": "EA Electronic Attack (EA) is the active component of EW that uses electromagnetic energy, directed energy, or anti-radiation weapons to intentionally degrade, neutralize, or destroy enemy combat capability, with the most common form being the deployment of jamming signals designed to overwhelm and mask friendly signals within a target receiver's bandwidth."
        },
        {
            "id": "6.6.3",
            "name": "EP",
            "description": "EP Electronic Protection (EP) involves all defensive measures within EW intended to safeguard friendly electronic systems against any adverse effects of enemy or friendly electronic attack, encompassing techniques like frequency hopping, spread spectrum modulation, and advanced receiver designs (Electronic Counter-Countermeasures or ECCM) to ensure communication and sensor functionality is maintained."
        },
        {
            "id": "6.6.4",
            "name": "jamming",
            "description": "jamming Jamming is the deliberate radiation of powerful electromagnetic noise or structured false signals intended to deny the effective use of a target communications link or radar system by overwhelming the receiver's signal-to-noise ratio (SNR), rendering the true incoming signal undetectable or unintelligible."
        },
        {
            "id": "6.6.5",
            "name": "protection",
            "description": "protection In RF system design, protection refers to the implementation of passive and active defense mechanisms, including EP techniques, robust filtering, anti-aliasing measures, and physical shielding, all aimed at enhancing the resilience and operational availability of the RF equipment against both intentional interference (jamming) and unintentional electromagnetic interference (EMI)."
        },
        {
            "id": "6.7.1",
            "name": "Guard bands",
            "description": "Guard bands Guard bands are unoccupied frequency segments strategically placed between allocated communication channels within a spectrum to prevent spectral overlap, mitigate adjacent channel interference (ACI) caused by non-ideal filtering, and accommodate the spectral side-lobes and frequency drift inherent in real-world transmitters."
        },
        {
            "id": "6.7.2",
            "name": "filtering",
            "description": "filtering Filtering is the process of using frequency-selective circuits (filters) to attenuate unwanted signals outside a desired frequency band while allowing the desired signal to pass with minimal loss, a critical function in both transmitters (for harmonic rejection) and receivers (for noise and interference rejection)."
        },
        {
            "id": "6.7.3",
            "name": "cancellation",
            "description": "cancellation Cancellation is an advanced signal processing technique, particularly important in full-duplex systems or cognitive radio, where a known unwanted signal—such as self-interference leakage from a local transmitter—is precisely estimated, inverted in phase, and dynamically subtracted from the received signal path to achieve high levels of isolation."
        },
        {
            "id": "6.9.1",
            "name": "IQ imbalance",
            "description": "IQ imbalance IQ imbalance is a non-ideal condition in quadrature modulation and demodulation caused by either a mismatch in the gain (amplitude) between the In-phase (I) and Quadrature (Q) paths or a phase error where the components are not precisely 90 degrees apart, resulting in the generation of an unwanted image frequency component and degradation of overall system linearity and error vector magnitude (EVM)."
        },
        {
            "id": "6.9.2",
            "name": "DPD",
            "description": "DPD Digital Pre-Distortion (DPD) is a sophisticated linearization technique implemented in the digital domain to mitigate the non-linear distortion produced by power amplifiers (PAs), where the input signal is strategically distorted with the inverse characteristics of the PA prior to transmission, significantly improving spectral efficiency, reducing out-of-band emissions, and maximizing PA operating efficiency."
        },
        {
            "id": "6.9.3",
            "name": "synchronization",
            "description": "synchronization Synchronization is the fundamental process in a receiver where the local timing parameters, including frequency offset, phase, and symbol timing, are precisely aligned with those of the incoming signal, enabling the receiver to accurately sample, track, and correctly demodulate the transmitted data symbols."
        },
        {
            "id": "7.1.1",
            "name": "Microstrip",
            "description": "Microstrip Microstrip is a prevalent planar transmission line structure in microwave circuits, composed of a conductive trace separated from a continuous ground plane by a dielectric substrate, valued for its ease of fabrication and integration, though it is prone to radiation and dispersion, particularly at higher frequencies."
        },
        {
            "id": "7.1.2",
            "name": "CPW",
            "description": "CPW Coplanar Waveguide (CPW) is a planar transmission line structure where the signal conductor and the return ground conductors are all located on the same side of the dielectric substrate, offering excellent isolation, low dispersion, and simplifying component mounting and integration, especially beneficial for use with probe stations."
        },
        {
            "id": "7.1.3",
            "name": "grounding",
            "description": "grounding Grounding in RF circuits refers to establishing a robust, low-impedance electrical connection to a reference plane, which is essential for defining the signal return path of transmission lines, minimizing common-mode currents, managing electromagnetic compatibility (EMC), and ensuring system stability."
        },
        {
            "id": "7.1.4",
            "name": "shielding",
            "description": "shielding Shielding involves using conductive barriers or enclosures to block the propagation of electromagnetic energy, preventing external interference from entering sensitive RF circuitry and, conversely, containing the emissions generated by the circuit, thereby ensuring signal integrity and compliance with regulatory emission standards."
        },
        {
            "id": "7.2.1",
            "name": "MMICs",
            "description": "MMICs Monolithic Microwave Integrated Circuits (MMICs) are integrated circuits where all active and passive components required for RF functions, such as transistors, filters, and transmission lines, are fabricated onto a single semiconductor substrate, typically GaAs or GaN, providing highly integrated, miniature, and broadband performance from UHF up to millimeter-wave frequencies."
        },
        {
            "id": "7.2.2",
            "name": "SiP",
            "description": "SiP System-in-Package (SiP) is an advanced packaging methodology where multiple semiconductor dies (chips) of different functionalities, sometimes including passive components and MEMS devices, are assembled and interconnected within a single standard integrated circuit package, offering high integration density without requiring complete redesign of the internal dies."
        },
        {
            "id": "7.2.3",
            "name": "SoC",
            "description": "SoC System-on-Chip (SoC) is a highly integrated single silicon die that incorporates all or most of the necessary electronic systems components, including digital processing units, memory interfaces, and complex RF front-ends, aiming for maximal integration, minimum power consumption, and overall smaller physical size compared to multi-chip solutions."
        },
        {
            "id": "7.2.4",
            "name": "thermal design",
            "description": "thermal design Thermal design is the critical engineering process focused on managing and dissipating the waste heat generated by active RF components, particularly power amplifiers, as uncontrolled temperature rise leads to reduced component efficiency, shifting of operational frequencies, device performance degradation, and ultimately limits component lifespan and reliability."
        },
        {
            "id": "7.3.1",
            "name": "Error budgets",
            "description": "Error budgets are critical tools in RF system design and measurement, rigorously quantifying and summing all known or estimated sources of uncertainty (e.g., thermal noise, component tolerances, calibration drift) that contribute to the overall degradation or imprecision of a system's performance metric, such as gain, noise figure, or phase accuracy, ensuring the final calculated performance meets the required specifications with a defined margin."
        },
        {
            "id": "7.3.2",
            "name": "repeatability",
            "description": "Repeatability, in the context of RF measurements, is the crucial metric defining the closeness of agreement between successive measurements of the same quantity, taken under identical conditions—using the same instrument, operator, location, and short time interval—and is fundamental for establishing the stability and intrinsic precision of a measurement setup or a DUT (Device Under Test)."
        },
        {
            "id": "7.3.3",
            "name": "statistical validation",
            "description": "Statistical validation applies rigorous mathematical and statistical techniques, such as hypothesis testing, confidence intervals, and regression analysis, to analyze large datasets of RF measurements or simulations, confirming whether the observed results are statistically significant, reliable, and representative of the system's true behavior under varying conditions, thereby mitigating the risk of relying on random or artifactual results."
        }
    ],
    "links": [
        {
            "source": "1.1",
            "target": "1.3",
            "type": "depends on"
        },
        {
            "source": "1.1",
            "target": "1.4",
            "type": "implemented in"
        },
        {
            "source": "1.2",
            "target": "2.1",
            "type": "depends on"
        },
        {
            "source": "1.5",
            "target": "2.1",
            "type": "depends on"
        },
        {
            "source": "1.5",
            "target": "6.10",
            "type": "modeled in"
        },
        {
            "source": "1.6",
            "target": "2.1",
            "type": "depends on"
        },
        {
            "source": "1.6",
            "target": "6.1",
            "type": "extends"
        },
        {
            "source": "2.1",
            "target": "3.2",
            "type": "measured by"
        },
        {
            "source": "2.2",
            "target": "3.5",
            "type": "measured by"
        },
        {
            "source": "2.3",
            "target": "3.2",
            "type": "affects"
        },
        {
            "source": "2.3",
            "target": "3.3",
            "type": "affects"
        },
        {
            "source": "2.4",
            "target": "3.5",
            "type": "measured by"
        },
        {
            "source": "2.5",
            "target": "1.4.6",
            "type": "implemented in"
        },
        {
            "source": "2.6",
            "target": "1.4",
            "type": "depends on"
        },
        {
            "source": "2.6",
            "target": "6.9",
            "type": "verified by"
        },
        {
            "source": "3.1",
            "target": "1.4.8",
            "type": "verified by"
        },
        {
            "source": "3.1",
            "target": "4.1",
            "type": "measured by"
        },
        {
            "source": "3.2",
            "target": "4.2",
            "type": "measured by"
        },
        {
            "source": "3.3",
            "target": "5.1",
            "type": "modeled in"
        },
        {
            "source": "3.4",
            "target": "5.2",
            "type": "measured by"
        },
        {
            "source": "3.5",
            "target": "4.6",
            "type": "verified by"
        },
        {
            "source": "3.6",
            "target": "6.10",
            "type": "modeled in"
        },
        {
            "source": "1.4.8",
            "target": "3",
            "type": "depends on"
        },
        {
            "source": "4.1",
            "target": "1.4.8",
            "type": "applied to"
        },
        {
            "source": "4.1",
            "target": "4.4",
            "type": "depends on"
        },
        {
            "source": "4.2",
            "target": "4.5",
            "type": "extends"
        },
        {
            "source": "4.3",
            "target": "5.5",
            "type": "used in"
        },
        {
            "source": "4.4",
            "target": "6.9",
            "type": "depends on"
        },
        {
            "source": "4.4",
            "target": "7.3",
            "type": "verified by"
        },
        {
            "source": "4.6",
            "target": "5.3",
            "type": "applied to"
        },
        {
            "source": "5.1",
            "target": "3.3",
            "type": "verifies"
        },
        {
            "source": "5.1",
            "target": "6.10",
            "type": "implemented in"
        },
        {
            "source": "5.2",
            "target": "3.4",
            "type": "verifies"
        },
        {
            "source": "5.2",
            "target": "5.4",
            "type": "extends"
        },
        {
            "source": "5.3",
            "target": "1.2",
            "type": "depends on"
        },
        {
            "source": "5.3",
            "target": "4.6",
            "type": "verified by"
        },
        {
            "source": "5.4",
            "target": "2.1",
            "type": "verified by"
        },
        {
            "source": "5.4",
            "target": "1.5",
            "type": "verified by"
        },
        {
            "source": "5.5",
            "target": "4.3",
            "type": "depends on"
        },
        {
            "source": "5.6",
            "target": "6.7",
            "type": "depends on"
        },
        {
            "source": "5.6",
            "target": "6.8",
            "type": "interacts with"
        },
        {
            "source": "6.1",
            "target": "1.6",
            "type": "depends on"
        },
        {
            "source": "6.1",
            "target": "4.5",
            "type": "verified by"
        },
        {
            "source": "6.1",
            "target": "6.8",
            "type": "interacts with"
        },
        {
            "source": "6.2",
            "target": "3.3",
            "type": "depends on"
        },
        {
            "source": "6.2",
            "target": "5.1",
            "type": "verified by"
        },
        {
            "source": "6.3",
            "target": "6.8",
            "type": "interacts with"
        },
        {
            "source": "6.3",
            "target": "6.10",
            "type": "modeled in"
        },
        {
            "source": "6.4",
            "target": "6.3",
            "type": "applied to"
        },
        {
            "source": "6.4",
            "target": "6.10",
            "type": "used in"
        },
        {
            "source": "6.4",
            "target": "5.5",
            "type": "used in"
        },
        {
            "source": "6.5",
            "target": "6.8",
            "type": "interacts with"
        },
        {
            "source": "6.5",
            "target": "6.14",
            "type": "extends"
        },
        {
            "source": "6.6",
            "target": "6.3",
            "type": "interacts with"
        },
        {
            "source": "6.6",
            "target": "6.5",
            "type": "interacts with"
        },
        {
            "source": "6.6",
            "target": "6.7",
            "type": "depends on"
        },
        {
            "source": "6.7",
            "target": "2.4",
            "type": "depends on"
        },
        {
            "source": "6.7",
            "target": "5.6",
            "type": "interacts with"
        },
        {
            "source": "6.8",
            "target": "6.1",
            "type": "depends on"
        },
        {
            "source": "6.8",
            "target": "6.5",
            "type": "interacts with"
        },
        {
            "source": "6.8",
            "target": "6.10",
            "type": "modeled in"
        },
        {
            "source": "6.9",
            "target": "4.4",
            "type": "depends on"
        },
        {
            "source": "6.9",
            "target": "7.3",
            "type": "affects"
        },
        {
            "source": "6.10",
            "target": "1.5",
            "type": "depends on"
        },
        {
            "source": "6.10",
            "target": "5.1",
            "type": "extends"
        },
        {
            "source": "6.10",
            "target": "5.4",
            "type": "verified by"
        },
        {
            "source": "6.11",
            "target": "1.5",
            "type": "depends on"
        },
        {
            "source": "6.11",
            "target": "2.1",
            "type": "depends on"
        },
        {
            "source": "6.12",
            "target": "1.4",
            "type": "implemented in"
        },
        {
            "source": "6.12",
            "target": "4.6",
            "type": "verified by"
        },
        {
            "source": "6.12",
            "target": "6.9",
            "type": "depends on"
        },
        {
            "source": "6.13",
            "target": "5.3",
            "type": "depends on"
        },
        {
            "source": "6.13",
            "target": "6.4",
            "type": "extends"
        },
        {
            "source": "6.14",
            "target": "6.1",
            "type": "extends"
        },
        {
            "source": "6.14",
            "target": "1.5",
            "type": "depends on"
        },
        {
            "source": "6.14",
            "target": "6.8",
            "type": "interacts with"
        },
        {
            "source": "6.15",
            "target": "2.2",
            "type": "affects"
        },
        {
            "source": "6.15",
            "target": "6.9",
            "type": "verified by"
        },
        {
            "source": "6.15",
            "target": "7.3",
            "type": "affects"
        },
        {
            "source": "7.1",
            "target": "1.4",
            "type": "implemented in"
        },
        {
            "source": "7.1",
            "target": "6.9",
            "type": "depends on"
        },
        {
            "source": "7.2",
            "target": "2.5",
            "type": "affects"
        },
        {
            "source": "7.2",
            "target": "6.9",
            "type": "depends on"
        },
        {
            "source": "7.3",
            "target": "4.4",
            "type": "verified by"
        },
        {
            "source": "7.3",
            "target": "6.9",
            "type": "depends on"
        },
        {
            "source": "7.3",
            "target": "4.6",
            "type": "applied to"
        },
        {
            "source": "1",
            "target": "1.1",
            "type": "sub topic"
        },
        {
            "source": "1",
            "target": "1.2",
            "type": "sub topic"
        },
        {
            "source": "1",
            "target": "1.3",
            "type": "sub topic"
        },
        {
            "source": "1",
            "target": "1.4",
            "type": "sub topic"
        },
        {
            "source": "1",
            "target": "1.5",
            "type": "sub topic"
        },
        {
            "source": "1",
            "target": "1.6",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.1",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.1",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.2",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.2",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.3",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.3",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.4",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.5",
            "type": "sub topic"
        },
        {
            "source": "2",
            "target": "2.6",
            "type": "sub topic"
        },
        {
            "source": "3",
            "target": "3.1",
            "type": "sub topic"
        },
        {
            "source": "3",
            "target": "3.2",
            "type": "sub topic"
        },
        {
            "source": "3",
            "target": "3.3",
            "type": "sub topic"
        },
        {
            "source": "3",
            "target": "3.4",
            "type": "sub topic"
        },
        {
            "source": "3",
            "target": "3.5",
            "type": "sub topic"
        },
        {
            "source": "3",
            "target": "3.6",
            "type": "sub topic"
        },
        {
            "source": "4",
            "target": "4.1",
            "type": "sub topic"
        },
        {
            "source": "4",
            "target": "4.2",
            "type": "sub topic"
        },
        {
            "source": "4",
            "target": "4.3",
            "type": "sub topic"
        },
        {
            "source": "4",
            "target": "4.4",
            "type": "sub topic"
        },
        {
            "source": "4",
            "target": "4.5",
            "type": "sub topic"
        },
        {
            "source": "4",
            "target": "4.6",
            "type": "sub topic"
        },
        {
            "source": "5",
            "target": "5.1",
            "type": "sub topic"
        },
        {
            "source": "5",
            "target": "5.2",
            "type": "sub topic"
        },
        {
            "source": "5",
            "target": "5.3",
            "type": "sub topic"
        },
        {
            "source": "5",
            "target": "5.4",
            "type": "sub topic"
        },
        {
            "source": "5",
            "target": "5.5",
            "type": "sub topic"
        },
        {
            "source": "5",
            "target": "5.6",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.1",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.1",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.11",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.12",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.13",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.14",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.15",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.2",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.3",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.4",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.5",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.6",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.7",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.8",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.9",
            "type": "sub topic"
        },
        {
            "source": "7",
            "target": "7.1",
            "type": "sub topic"
        },
        {
            "source": "7",
            "target": "7.2",
            "type": "sub topic"
        },
        {
            "source": "7",
            "target": "7.3",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.1",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.10",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.2",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.3",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.4",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.5",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.6",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.7",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.8",
            "type": "sub topic"
        },
        {
            "source": "1.1",
            "target": "1.1.9",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.1",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.2",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.3",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.4",
            "type": "sub topic"
        },
        {
            "source": "1.2.4",
            "target": "1.2.4.1",
            "type": "sub topic"
        },
        {
            "source": "1.2.4",
            "target": "1.2.4.2",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.5",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.6",
            "type": "sub topic"
        },
        {
            "source": "1.2.6",
            "target": "1.2.6.1",
            "type": "sub topic"
        },
        {
            "source": "1.2.6",
            "target": "1.2.6.2",
            "type": "sub topic"
        },
        {
            "source": "1.2.6",
            "target": "1.2.6.3",
            "type": "sub topic"
        },
        {
            "source": "1.2",
            "target": "1.2.7",
            "type": "sub topic"
        },
        {
            "source": "1.3",
            "target": "1.3.1",
            "type": "sub topic"
        },
        {
            "source": "1.3",
            "target": "1.3.2",
            "type": "sub topic"
        },
        {
            "source": "1.3",
            "target": "1.3.3",
            "type": "sub topic"
        },
        {
            "source": "1.3.3",
            "target": "1.3.3.1",
            "type": "sub topic"
        },
        {
            "source": "1.3.3",
            "target": "1.3.3.2",
            "type": "sub topic"
        },
        {
            "source": "1.3.3",
            "target": "1.3.3.3",
            "type": "sub topic"
        },
        {
            "source": "1.3",
            "target": "1.3.4",
            "type": "sub topic"
        },
        {
            "source": "1.3.4",
            "target": "1.3.4.1",
            "type": "sub topic"
        },
        {
            "source": "1.3.4",
            "target": "1.3.4.2",
            "type": "sub topic"
        },
        {
            "source": "1.3.4",
            "target": "1.3.4.3",
            "type": "sub topic"
        },
        {
            "source": "1.3",
            "target": "1.3.5",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.1",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.2",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.3",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.4",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.5",
            "type": "sub topic"
        },
        {
            "source": "1.4.5",
            "target": "1.4.5.1",
            "type": "sub topic"
        },
        {
            "source": "1.4.5",
            "target": "1.4.5.2",
            "type": "sub topic"
        },
        {
            "source": "1.4.5",
            "target": "1.4.5.3",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.6",
            "type": "sub topic"
        },
        {
            "source": "1.4.6",
            "target": "1.4.6.1",
            "type": "sub topic"
        },
        {
            "source": "1.4.6",
            "target": "1.4.6.2",
            "type": "sub topic"
        },
        {
            "source": "1.4.6",
            "target": "1.4.6.3",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.7",
            "type": "sub topic"
        },
        {
            "source": "1.4.7",
            "target": "1.4.7.1",
            "type": "sub topic"
        },
        {
            "source": "1.4.7",
            "target": "1.4.7.2",
            "type": "sub topic"
        },
        {
            "source": "1.4.7",
            "target": "1.4.7.3",
            "type": "sub topic"
        },
        {
            "source": "1.4",
            "target": "1.4.8",
            "type": "sub topic"
        },
        {
            "source": "1.4.8",
            "target": "1.4.8.1",
            "type": "sub topic"
        },
        {
            "source": "1.4.8",
            "target": "1.4.8.2",
            "type": "sub topic"
        },
        {
            "source": "1.4.8",
            "target": "1.4.8.3",
            "type": "sub topic"
        },
        {
            "source": "1.4.8",
            "target": "1.4.8.4",
            "type": "sub topic"
        },
        {
            "source": "1.5",
            "target": "1.5.1",
            "type": "sub topic"
        },
        {
            "source": "1.5",
            "target": "1.5.2",
            "type": "sub topic"
        },
        {
            "source": "1.5",
            "target": "1.5.3",
            "type": "sub topic"
        },
        {
            "source": "1.5",
            "target": "1.5.4",
            "type": "sub topic"
        },
        {
            "source": "1.5",
            "target": "1.5.5",
            "type": "sub topic"
        },
        {
            "source": "1.5.5",
            "target": "1.5.5.1",
            "type": "sub topic"
        },
        {
            "source": "1.5.5",
            "target": "1.5.5.2",
            "type": "sub topic"
        },
        {
            "source": "1.5.5",
            "target": "1.5.5.3",
            "type": "sub topic"
        },
        {
            "source": "1.5",
            "target": "1.5.6",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.1",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.1",
            "type": "sub topic"
        },
        {
            "source": "1.6.1",
            "target": "1.6.1.1",
            "type": "sub topic"
        },
        {
            "source": "1.6.1",
            "target": "1.6.1.2",
            "type": "sub topic"
        },
        {
            "source": "1.6.1",
            "target": "1.6.1.3",
            "type": "sub topic"
        },
        {
            "source": "1.6.1",
            "target": "1.6.1.4",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.2",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.2",
            "type": "sub topic"
        },
        {
            "source": "1.6.2",
            "target": "1.6.2.1",
            "type": "sub topic"
        },
        {
            "source": "1.6.2",
            "target": "1.6.2.2",
            "type": "sub topic"
        },
        {
            "source": "1.6.2",
            "target": "1.6.2.3",
            "type": "sub topic"
        },
        {
            "source": "1.6.2",
            "target": "1.6.2.4",
            "type": "sub topic"
        },
        {
            "source": "1.6.2",
            "target": "1.6.2.5",
            "type": "sub topic"
        },
        {
            "source": "1.6.2",
            "target": "1.6.2.6",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.3",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.4",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.5",
            "type": "sub topic"
        },
        {
            "source": "1.6",
            "target": "1.6.6",
            "type": "sub topic"
        },
        {
            "source": "1.6.6",
            "target": "1.6.6.1",
            "type": "sub topic"
        },
        {
            "source": "1.6.6",
            "target": "1.6.6.2",
            "type": "sub topic"
        },
        {
            "source": "1.6.6",
            "target": "1.6.6.3",
            "type": "sub topic"
        },
        {
            "source": "1.6.6",
            "target": "1.6.6.4",
            "type": "sub topic"
        },
        {
            "source": "2.1",
            "target": "2.1.1",
            "type": "sub topic"
        },
        {
            "source": "2.1",
            "target": "2.1.2",
            "type": "sub topic"
        },
        {
            "source": "2.1",
            "target": "2.1.3",
            "type": "sub topic"
        },
        {
            "source": "2.1",
            "target": "2.1.4",
            "type": "sub topic"
        },
        {
            "source": "2.2",
            "target": "2.2.1",
            "type": "sub topic"
        },
        {
            "source": "2.2",
            "target": "2.2.2",
            "type": "sub topic"
        },
        {
            "source": "2.2.2",
            "target": "2.2.2.1",
            "type": "sub topic"
        },
        {
            "source": "2.2.2",
            "target": "2.2.2.2",
            "type": "sub topic"
        },
        {
            "source": "2.2.2",
            "target": "2.2.2.3",
            "type": "sub topic"
        },
        {
            "source": "2.2",
            "target": "2.2.3",
            "type": "sub topic"
        },
        {
            "source": "2.3",
            "target": "2.3.1",
            "type": "sub topic"
        },
        {
            "source": "2.3",
            "target": "2.3.2",
            "type": "sub topic"
        },
        {
            "source": "2.3",
            "target": "2.3.2",
            "type": "sub topic"
        },
        {
            "source": "2.3",
            "target": "2.3.3",
            "type": "sub topic"
        },
        {
            "source": "2.3",
            "target": "2.3.3",
            "type": "sub topic"
        },
        {
            "source": "2.3",
            "target": "2.3.4",
            "type": "sub topic"
        },
        {
            "source": "2.3.4",
            "target": "2.3.4.1",
            "type": "sub topic"
        },
        {
            "source": "2.3.4",
            "target": "2.3.4.2",
            "type": "sub topic"
        },
        {
            "source": "2.4",
            "target": "2.4.1",
            "type": "sub topic"
        },
        {
            "source": "2.4",
            "target": "2.4.2",
            "type": "sub topic"
        },
        {
            "source": "2.4",
            "target": "2.4.3",
            "type": "sub topic"
        },
        {
            "source": "2.5",
            "target": "2.5.1",
            "type": "sub topic"
        },
        {
            "source": "2.5",
            "target": "2.5.2",
            "type": "sub topic"
        },
        {
            "source": "2.5",
            "target": "2.5.3",
            "type": "sub topic"
        },
        {
            "source": "2.6",
            "target": "2.6.1",
            "type": "sub topic"
        },
        {
            "source": "2.6.1",
            "target": "2.6.1.1",
            "type": "sub topic"
        },
        {
            "source": "2.6.1",
            "target": "2.6.1.2",
            "type": "sub topic"
        },
        {
            "source": "2.6.1",
            "target": "2.6.1.3",
            "type": "sub topic"
        },
        {
            "source": "2.6",
            "target": "2.6.2",
            "type": "sub topic"
        },
        {
            "source": "2.6",
            "target": "2.6.3",
            "type": "sub topic"
        },
        {
            "source": "2.6.3",
            "target": "2.6.3.1",
            "type": "sub topic"
        },
        {
            "source": "2.6.3",
            "target": "2.6.3.2",
            "type": "sub topic"
        },
        {
            "source": "2.6",
            "target": "2.6.4",
            "type": "sub topic"
        },
        {
            "source": "3.1",
            "target": "3.1.1",
            "type": "sub topic"
        },
        {
            "source": "3.1",
            "target": "3.1.2",
            "type": "sub topic"
        },
        {
            "source": "3.1",
            "target": "3.1.3",
            "type": "sub topic"
        },
        {
            "source": "3.1",
            "target": "3.1.4",
            "type": "sub topic"
        },
        {
            "source": "3.2",
            "target": "3.2.1",
            "type": "sub topic"
        },
        {
            "source": "3.2",
            "target": "3.2.2",
            "type": "sub topic"
        },
        {
            "source": "3.2",
            "target": "3.2.3",
            "type": "sub topic"
        },
        {
            "source": "3.2",
            "target": "3.2.4",
            "type": "sub topic"
        },
        {
            "source": "3.3",
            "target": "3.3.1",
            "type": "sub topic"
        },
        {
            "source": "3.3",
            "target": "3.3.2",
            "type": "sub topic"
        },
        {
            "source": "3.3",
            "target": "3.3.3",
            "type": "sub topic"
        },
        {
            "source": "3.3",
            "target": "3.3.4",
            "type": "sub topic"
        },
        {
            "source": "3.4",
            "target": "3.4.1",
            "type": "sub topic"
        },
        {
            "source": "3.4",
            "target": "3.4.2",
            "type": "sub topic"
        },
        {
            "source": "3.4",
            "target": "3.4.3",
            "type": "sub topic"
        },
        {
            "source": "3.4.3",
            "target": "3.4.3.1",
            "type": "sub topic"
        },
        {
            "source": "3.4.3",
            "target": "3.4.3.2",
            "type": "sub topic"
        },
        {
            "source": "3.4.3",
            "target": "3.4.3.3",
            "type": "sub topic"
        },
        {
            "source": "3.5",
            "target": "3.5.1",
            "type": "sub topic"
        },
        {
            "source": "3.5",
            "target": "3.5.2",
            "type": "sub topic"
        },
        {
            "source": "3.5",
            "target": "3.5.3",
            "type": "sub topic"
        },
        {
            "source": "3.6",
            "target": "3.6.1",
            "type": "sub topic"
        },
        {
            "source": "3.6",
            "target": "3.6.2",
            "type": "sub topic"
        },
        {
            "source": "4.1",
            "target": "4.1.1",
            "type": "sub topic"
        },
        {
            "source": "4.1",
            "target": "4.1.2",
            "type": "sub topic"
        },
        {
            "source": "4.1",
            "target": "4.1.3",
            "type": "sub topic"
        },
        {
            "source": "4.1",
            "target": "4.1.4",
            "type": "sub topic"
        },
        {
            "source": "4.2",
            "target": "4.2.1",
            "type": "sub topic"
        },
        {
            "source": "4.2",
            "target": "4.2.2",
            "type": "sub topic"
        },
        {
            "source": "4.2",
            "target": "4.2.3",
            "type": "sub topic"
        },
        {
            "source": "4.2",
            "target": "4.2.4",
            "type": "sub topic"
        },
        {
            "source": "4.3",
            "target": "4.3.1",
            "type": "sub topic"
        },
        {
            "source": "4.3",
            "target": "4.3.2",
            "type": "sub topic"
        },
        {
            "source": "4.3",
            "target": "4.3.3",
            "type": "sub topic"
        },
        {
            "source": "4.3",
            "target": "4.3.4",
            "type": "sub topic"
        },
        {
            "source": "4.5",
            "target": "4.5.1",
            "type": "sub topic"
        },
        {
            "source": "4.5",
            "target": "4.5.2",
            "type": "sub topic"
        },
        {
            "source": "4.5",
            "target": "4.5.3",
            "type": "sub topic"
        },
        {
            "source": "5.3",
            "target": "5.3.1",
            "type": "sub topic"
        },
        {
            "source": "5.3",
            "target": "5.3.2",
            "type": "sub topic"
        },
        {
            "source": "5.3",
            "target": "5.3.3",
            "type": "sub topic"
        },
        {
            "source": "5.3",
            "target": "5.3.4",
            "type": "sub topic"
        },
        {
            "source": "5.4",
            "target": "5.4.1",
            "type": "sub topic"
        },
        {
            "source": "5.4",
            "target": "5.4.2",
            "type": "sub topic"
        },
        {
            "source": "5.5",
            "target": "5.5.1",
            "type": "sub topic"
        },
        {
            "source": "5.5",
            "target": "5.5.2",
            "type": "sub topic"
        },
        {
            "source": "5.5",
            "target": "5.5.3",
            "type": "sub topic"
        },
        {
            "source": "6.1",
            "target": "6.1.1",
            "type": "sub topic"
        },
        {
            "source": "6.1",
            "target": "6.1.2",
            "type": "sub topic"
        },
        {
            "source": "6.1",
            "target": "6.1.3",
            "type": "sub topic"
        },
        {
            "source": "6",
            "target": "6.10",
            "type": "sub topic"
        },
        {
            "source": "6.10",
            "target": "6.10.1",
            "type": "sub topic"
        },
        {
            "source": "6.10",
            "target": "6.10.2",
            "type": "sub topic"
        },
        {
            "source": "6.10",
            "target": "6.10.3",
            "type": "sub topic"
        },
        {
            "source": "6.11",
            "target": "6.11.1",
            "type": "sub topic"
        },
        {
            "source": "6.11",
            "target": "6.11.2",
            "type": "sub topic"
        },
        {
            "source": "6.11",
            "target": "6.11.3",
            "type": "sub topic"
        },
        {
            "source": "6.12",
            "target": "6.12.1",
            "type": "sub topic"
        },
        {
            "source": "6.12",
            "target": "6.12.2",
            "type": "sub topic"
        },
        {
            "source": "6.12",
            "target": "6.12.3",
            "type": "sub topic"
        },
        {
            "source": "6.13",
            "target": "6.13.1",
            "type": "sub topic"
        },
        {
            "source": "6.13",
            "target": "6.13.2",
            "type": "sub topic"
        },
        {
            "source": "6.13",
            "target": "6.13.3",
            "type": "sub topic"
        },
        {
            "source": "6.14",
            "target": "6.14.1",
            "type": "sub topic"
        },
        {
            "source": "6.14",
            "target": "6.14.2",
            "type": "sub topic"
        },
        {
            "source": "6.15",
            "target": "6.15.1",
            "type": "sub topic"
        },
        {
            "source": "6.15",
            "target": "6.15.2",
            "type": "sub topic"
        },
        {
            "source": "6.15",
            "target": "6.15.3",
            "type": "sub topic"
        },
        {
            "source": "6.2",
            "target": "6.2.1",
            "type": "sub topic"
        },
        {
            "source": "6.2",
            "target": "6.2.2",
            "type": "sub topic"
        },
        {
            "source": "6.2",
            "target": "6.2.3",
            "type": "sub topic"
        },
        {
            "source": "6.2",
            "target": "6.2.4",
            "type": "sub topic"
        },
        {
            "source": "6.2",
            "target": "6.2.5",
            "type": "sub topic"
        },
        {
            "source": "6.4",
            "target": "6.4.1",
            "type": "sub topic"
        },
        {
            "source": "6.4",
            "target": "6.4.2",
            "type": "sub topic"
        },
        {
            "source": "6.5",
            "target": "6.5.1",
            "type": "sub topic"
        },
        {
            "source": "6.5",
            "target": "6.5.2",
            "type": "sub topic"
        },
        {
            "source": "6.5",
            "target": "6.5.3",
            "type": "sub topic"
        },
        {
            "source": "6.5",
            "target": "6.5.4",
            "type": "sub topic"
        },
        {
            "source": "6.6",
            "target": "6.6.1",
            "type": "sub topic"
        },
        {
            "source": "6.6",
            "target": "6.6.2",
            "type": "sub topic"
        },
        {
            "source": "6.6",
            "target": "6.6.3",
            "type": "sub topic"
        },
        {
            "source": "6.6",
            "target": "6.6.4",
            "type": "sub topic"
        },
        {
            "source": "6.6",
            "target": "6.6.5",
            "type": "sub topic"
        },
        {
            "source": "6.7",
            "target": "6.7.1",
            "type": "sub topic"
        },
        {
            "source": "6.7",
            "target": "6.7.2",
            "type": "sub topic"
        },
        {
            "source": "6.7",
            "target": "6.7.3",
            "type": "sub topic"
        },
        {
            "source": "6.9",
            "target": "6.9.1",
            "type": "sub topic"
        },
        {
            "source": "6.9",
            "target": "6.9.2",
            "type": "sub topic"
        },
        {
            "source": "6.9",
            "target": "6.9.3",
            "type": "sub topic"
        },
        {
            "source": "7.1",
            "target": "7.1.1",
            "type": "sub topic"
        },
        {
            "source": "7.1",
            "target": "7.1.2",
            "type": "sub topic"
        },
        {
            "source": "7.1",
            "target": "7.1.3",
            "type": "sub topic"
        },
        {
            "source": "7.1",
            "target": "7.1.4",
            "type": "sub topic"
        },
        {
            "source": "7.2",
            "target": "7.2.1",
            "type": "sub topic"
        },
        {
            "source": "7.2",
            "target": "7.2.2",
            "type": "sub topic"
        },
        {
            "source": "7.2",
            "target": "7.2.3",
            "type": "sub topic"
        },
        {
            "source": "7.2",
            "target": "7.2.4",
            "type": "sub topic"
        },
        {
            "source": "7.3",
            "target": "7.3.1",
            "type": "sub topic"
        },
        {
            "source": "7.3",
            "target": "7.3.2",
            "type": "sub topic"
        },
        {
            "source": "7.3",
            "target": "7.3.3",
            "type": "sub topic"
        }
    ]
}